wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
#ifndef PCC_REG_H
#define PCC_REG_H
#include <stdint.h>

/* ================================================================================ */
/* ================            System Block Control            ================ */
/* ================================================================================ */

/* Auto gen based on BB2Ultra_IO_module_20250206_v0.xlsx */

typedef struct
{
    /* 0x0200       0x4000_0200
        0       R/W    r_cpu_slow_en                           1'b0
        1       R/W    r_cpu_slow_opt_wfi                      1'b0
        2       R/W    r_cpu_slow_opt_dsp                      1'b0
        3       R/W    r_dsp_slow_en                           1'b0
        4       R/W    r_dsp_slow_opt_dsp                      1'b0
        5       R/W    r_auto_dsp_fast_clk_en                  1'b0
        6       R/W    r_clk_cpu_f1m_en                        1'b0
        7       R/W    r_clk_cpu_32k_en                        1'b0
        8       R/W    r_aon_rd_opt                            1'b1
        9       R/W    r_cpu_slow_opt_ppe1                     1'b0
        10      R/W    r_cpu_slow_opt_spic3                    1'b0
        18:11   R/W    r_dsp_fast_clk_ext_num                  8'b0
        25:19   R/W    r_bt_ahb_wait_cnt                       7'b0010001
        26      R/W    r_cpu_slow_opt_at_tx                    1'b1
        27      R/W    r_cpu_slow_opt_at_rx                    1'b1
        31:28   R/W    r_cpu_low_rate_valid_num                4'h3
    */
    union
    {
        __IO uint32_t SYS_CLK_SEL;
        struct
        {
            __IO uint32_t r_cpu_slow_en: 1;
            __IO uint32_t r_cpu_slow_opt_wfi: 1;
            __IO uint32_t r_cpu_slow_opt_dsp: 1;
            __IO uint32_t r_dsp_slow_en: 1;
            __IO uint32_t r_dsp_slow_opt_dsp: 1;
            __IO uint32_t r_auto_dsp_fast_clk_en: 1;
            __IO uint32_t r_clk_cpu_f1m_en: 1;
            __IO uint32_t r_clk_cpu_32k_en: 1;
            __IO uint32_t r_aon_rd_opt: 1;
            __IO uint32_t r_cpu_slow_opt_ppe1: 1;
            __IO uint32_t r_cpu_slow_opt_spic3: 1;
            __IO uint32_t r_dsp_fast_clk_ext_num: 8;
            __IO uint32_t r_bt_ahb_wait_cnt: 7;
            __IO uint32_t r_cpu_slow_opt_at_tx: 1;
            __IO uint32_t r_cpu_slow_opt_at_rx: 1;
            __IO uint32_t r_cpu_low_rate_valid_num: 4;
        } BITS_200;
    } u_200;

    /* 0x0204       0x4000_0204
        3:0     R      RF_RL_ID                                4'h0
        7:4     R      RF_RTL_ID                               4'h0
        8       R/W    r_btaon_acc_no_block                    1'b0
        9       R/W    r_cpu_slow_opt_spic0                    1'b0
        10      R/W    r_cpu_slow_opt_spic1                    1'b0
        11      R/W    r_cpu_slow_opt_spic2                    1'b0
        12      R/W    r_cpu_slow_opt_spi1                     1'b0
        13      R/W    r_dsp_clk_src_pll_sel                   1'b0
        14      R/W    r_dsp_auto_slow_filter_en               1'b1
        15      R/W    r_cpu_slow_opt_jpeg                     1'b0
        16      R/W    reserved0204_16                         1'b0
        17      R/W    reserved0204_17                         1'b0
        18      R/W    r_cpu_slow_opt_sdio1                    1'b0
        19      R/W    r_cpu_slow_opt_dma                      1'b0
        20      R/W    r_cpu_slow_opt_sdio0                    1'b0
        21      R/W    reserved0204_21                         1'b0
        22      R/W    r_cpu_slow_opt_bt_sram_1                1'b0
        23      R/W    r_cpu_slow_opt_bt_sram_2                1'b0
        24      R/W    r_cpu_slow_opt_usb                      1'b0
        25      R/W    r_cpu_slow_opt_gmac                     1'b0
        26      R/W    r_dsp_slow_opt_at_tx                    1'b1
        27      R/W    r_dsp_slow_opt_at_rx                    1'b1
        31:28   R/W    r_dsp_low_rate_valid_num                4'h3
    */
    union
    {
        __IO uint32_t SLOW_CTRL;
        struct
        {
            __I uint32_t RF_RL_ID: 4;
            __I uint32_t RF_RTL_ID: 4;
            __IO uint32_t r_btaon_acc_no_block: 1;
            __IO uint32_t r_cpu_slow_opt_spic0: 1;
            __IO uint32_t r_cpu_slow_opt_spic1: 1;
            __IO uint32_t r_cpu_slow_opt_spic2: 1;
            __IO uint32_t r_cpu_slow_opt_spi1: 1;
            __IO uint32_t r_dsp_clk_src_pll_sel: 1;
            __IO uint32_t r_dsp_auto_slow_filter_en: 1;
            __IO uint32_t r_cpu_slow_opt_jpeg: 1;
            __IO uint32_t reserved0204_16: 1;
            __IO uint32_t reserved0204_17: 1;
            __IO uint32_t r_cpu_slow_opt_sdio1: 1;
            __IO uint32_t r_cpu_slow_opt_dma: 1;
            __IO uint32_t r_cpu_slow_opt_sdio0: 1;
            __IO uint32_t reserved0204_21: 1;
            __IO uint32_t r_cpu_slow_opt_bt_sram_1: 1;
            __IO uint32_t r_cpu_slow_opt_bt_sram_2: 1;
            __IO uint32_t r_cpu_slow_opt_usb: 1;
            __IO uint32_t r_cpu_slow_opt_gmac: 1;
            __IO uint32_t r_dsp_slow_opt_at_tx: 1;
            __IO uint32_t r_dsp_slow_opt_at_rx: 1;
            __IO uint32_t r_dsp_low_rate_valid_num: 4;
        } BITS_204;
    } u_204;

    /* 0x0208       0x4000_0208
        3:0     R/W    r_cpu_div_sel                           4'h4
        7:4     R/W    r_cpu_div_sel_slow                      4'h4
        8       R/W    r_cpu_div_en                            1'b1
        9       R/W    r_CPU_CLK_SRC_EN                        1'b1
        10      R/W    r_cpu_auto_slow_filter_en               1'b1
        11      R/W    r_cpu_auto_slow_force_update            1'b0
        12      R/W    r_cpu_pll_clk_cg_en                     1'b1
        13      R/W    r_cpu_xtal_clk_cg_en                    1'b1
        14      R/W    r_cpu_osc40_clk_cg_en                   1'b1
        15      R/W    r_cpu_div_en_slow                       1'b1
        19:16   R/W    r_dsp_div_sel                           4'h0
        23:20   R/W    r_dsp_div_sel_slow                      4'h0
        24      R/W    r_dsp_div_en                            1'b0
        25      R/W    r_DSP_CLK_SRC_EN                        1'b1
        26      R/W    r_dsp_clk_src_sel_1                     1'b1
        27      R/W    r_dsp_clk_src_sel_0                     1'b0
        28      R/W    r_dsp_pll_clk_cg_en                     1'b0
        29      R/W    r_dsp_xtal_clk_cg_en                    1'b0
        30      R/W    r_dsp_osc40_clk_cg_en                   1'b0
        31      R/W    r_dsp_div_en_slow                       1'b0
    */
    union
    {
        __IO uint32_t REG_0x208;
        struct
        {
            __IO uint32_t r_cpu_div_sel: 4;
            __IO uint32_t r_cpu_div_sel_slow: 4;
            __IO uint32_t r_cpu_div_en: 1;
            __IO uint32_t r_CPU_CLK_SRC_EN: 1;
            __IO uint32_t r_cpu_auto_slow_filter_en: 1;
            __IO uint32_t r_cpu_auto_slow_force_update: 1;
            __IO uint32_t r_cpu_pll_clk_cg_en: 1;
            __IO uint32_t r_cpu_xtal_clk_cg_en: 1;
            __IO uint32_t r_cpu_osc40_clk_cg_en: 1;
            __IO uint32_t r_cpu_div_en_slow: 1;
            __IO uint32_t r_dsp_div_sel: 4;
            __IO uint32_t r_dsp_div_sel_slow: 4;
            __IO uint32_t r_dsp_div_en: 1;
            __IO uint32_t r_DSP_CLK_SRC_EN: 1;
            __IO uint32_t r_dsp_clk_src_sel_1: 1;
            __IO uint32_t r_dsp_clk_src_sel_0: 1;
            __IO uint32_t r_dsp_pll_clk_cg_en: 1;
            __IO uint32_t r_dsp_xtal_clk_cg_en: 1;
            __IO uint32_t r_dsp_osc40_clk_cg_en: 1;
            __IO uint32_t r_dsp_div_en_slow: 1;
        } BITS_208;
    } u_208;

    /* 0x020C       0x4000_020c
        3:0     R/W    r_flash_div_sel                         4'h0
        4       R/W    r_flash_div_en                          1'h0
        5       R/W    r_FLASH_CLK_SRC_EN                      1'h1
        6       R/W    r_flash_clk_src_sel_1                   1'h0
        7       R/W    r_flash_clk_src_sel_0                   1'h0
        8       R/W    r_flash_mux_1_clk_cg_en                 1'h1
        9       R/W    r_rng_sfosc_sel                         1'h0
        12:10   R/W    r_rng_sfosc_div_sel                     3'h0
        13      R/W    r_flash_clk_src_pll_sel_0               1'h0
        14      R/W    r_flash_clk_src_pll_sel_1               1'h0
        15      R/W    RESERVED80                              1'h0
        18:16   R/W    RESERVED79                              3'h0
        19      R/W    RESERVED78                              1'h0
        20      R/W    RESERVED77                              1'h0
        21      R/W    RESERVED76                              1'h1
        22      R/W    RESERVED75                              1'h1
        23      R/W    RESERVED74                              1'h0
        24      R/W    RESERVED73                              1'h1
        25      R/W    RESERVED72                              1'h0
        26      R/W    r_CLK_40M_SRC_DIV_EN                    1'h1
        27      R/W    r_CLK_20M_SRC_EN                        1'h0
        28      R/W    r_CLK_10M_SRC_EN                        1'h1
        29      R/W    r_CLK_5M_SRC_EN                         1'h0
        30      R/W    cpu_dsp_dvfs_clk_en                     1'h0
        31      R/W    cpu_dsp_gckmux_opt                      1'h0
    */
    union
    {
        __IO uint32_t REG_0x20C;
        struct
        {
            __IO uint32_t r_flash_div_sel: 4;
            __IO uint32_t r_flash_div_en: 1;
            __IO uint32_t r_FLASH_CLK_SRC_EN: 1;
            __IO uint32_t r_flash_clk_src_sel_1: 1;
            __IO uint32_t r_flash_clk_src_sel_0: 1;
            __IO uint32_t r_flash_mux_1_clk_cg_en: 1;
            __IO uint32_t r_rng_sfosc_sel: 1;
            __IO uint32_t r_rng_sfosc_div_sel: 3;
            __IO uint32_t r_flash_clk_src_pll_sel_0: 1;
            __IO uint32_t r_flash_clk_src_pll_sel_1: 1;
            __IO uint32_t RESERVED80: 1;
            __IO uint32_t RESERVED79: 3;
            __IO uint32_t RESERVED78: 1;
            __IO uint32_t RESERVED77: 1;
            __IO uint32_t RESERVED76: 1;
            __IO uint32_t RESERVED75: 1;
            __IO uint32_t RESERVED74: 1;
            __IO uint32_t RESERVED73: 1;
            __IO uint32_t RESERVED72: 1;
            __IO uint32_t r_CLK_40M_SRC_DIV_EN: 1;
            __IO uint32_t r_CLK_20M_SRC_EN: 1;
            __IO uint32_t r_CLK_10M_SRC_EN: 1;
            __IO uint32_t r_CLK_5M_SRC_EN: 1;
            __IO uint32_t cpu_dsp_dvfs_clk_en: 1;
            __IO uint32_t cpu_dsp_gckmux_opt: 1;
        } BITS_20C;
    } u_20C;

