wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x0210       0x4000_0210
        0       R/W    BIT_SOC_2P4G_EN                         1'h0
        1       R/W    BIT_SOC_SDH1_EN                         1'h0
        2       R/W    BIT_SOC_BTBUS_EN                        1'b1
        3       R/W    BIT_SOC_FLASH_3_EN                      1'h0
        4       R/W    BIT_SOC_FLASH_EN                        1'b1
        5       R/W    BIT_SOC_FLASH_1_EN                      1'h0
        6       R/W    BIT_SOC_FLASH_2_EN                      1'h0
        7       R/W    BIT_SOC_UART0_EN                        1'h0
        8       R/W    BIT_SOC_UART1_EN                        1'h0
        9       R/W    BIT_SOC_UART2_EN                        1'h0
        10      R/W    BIT_SOC_UART3_EN                        1'h0
        11      R/W    BIT_SOC_UART4_EN                        1'h0
        12      R/W    BIT_SOC_UART5_EN                        1'h0
        13      R/W    BIT_SOC_GDMA0_EN                        1'h0
        14      R/W    BIT_SOC_SDH0_EN                         1'h0
        15      R/W    RESERVED_0X210_15                       1'h0
        16      R/W    BIT_SOC_TIMER0_EN                       1'h0
        17      R/W    BIT_SOC_CAN2_EN                         1'h0
        18      R/W    BIT_SOC_SWR_SS_EN                       1'h0
        19      R/W    BIT_SOC_PDCK_EN                         1'h0
        20      R/W    BIT_SOC_AAC_XTAL_EN                     1'h0
        21      R/W    RESERVED102                             1'h0
        22      R/W    BIT_SOC_TIMER1_EN                       1'h0
        23      R/W    BIT_SOC_CAN0_EN                         1'h0
        24      R/W    BIT_SOC_PPE_EN                          1'h0
        25      R/W    BIT_SOC_PKE_EN                          1'h0
        26      R/W    BIT_SOC_RTZIP_EN                        1'h0
        27      R/W    BIT_SOC_CAN1_EN                         1'h0
        28      R/W    BIT_SOC_JPEG_EN                         1'h0
        29      R/W    BIT_SOC_GMAC_EN                         1'h0
        30      R/W    BIT_SOC_ZIGBEE_EN                       1'h0
        31      R/W    BIT_SOC_TIMER1_DEB_EN                   5'h0
    */
    union
    {
        __IO uint32_t SOC_FUNC_EN;
        struct
        {
            __IO uint32_t BIT_SOC_2P4G_EN: 1;
            __IO uint32_t BIT_SOC_SDH1_EN: 1;
            __IO uint32_t BIT_SOC_BTBUS_EN: 1;
            __IO uint32_t BIT_SOC_FLASH_3_EN: 1;
            __IO uint32_t BIT_SOC_FLASH_EN: 1;
            __IO uint32_t BIT_SOC_FLASH_1_EN: 1;
            __IO uint32_t BIT_SOC_FLASH_2_EN: 1;
            __IO uint32_t BIT_SOC_UART0_EN: 1;
            __IO uint32_t BIT_SOC_UART1_EN: 1;
            __IO uint32_t BIT_SOC_UART2_EN: 1;
            __IO uint32_t BIT_SOC_UART3_EN: 1;
            __IO uint32_t BIT_SOC_UART4_EN: 1;
            __IO uint32_t BIT_SOC_UART5_EN: 1;
            __IO uint32_t BIT_SOC_GDMA0_EN: 1;
            __IO uint32_t BIT_SOC_SDH0_EN: 1;
            __IO uint32_t RESERVED_0X210_15: 1;
            __IO uint32_t BIT_SOC_TIMER0_EN: 1;
            __IO uint32_t BIT_SOC_CAN2_EN: 1;
            __IO uint32_t BIT_SOC_SWR_SS_EN: 1;
            __IO uint32_t BIT_SOC_PDCK_EN: 1;
            __IO uint32_t BIT_SOC_AAC_XTAL_EN: 1;
            __IO uint32_t RESERVED102: 1;
            __IO uint32_t BIT_SOC_TIMER1_EN: 1;
            __IO uint32_t BIT_SOC_CAN0_EN: 1;
            __IO uint32_t BIT_SOC_PPE_EN: 1;
            __IO uint32_t BIT_SOC_PKE_EN: 1;
            __IO uint32_t BIT_SOC_RTZIP_EN: 1;
            __IO uint32_t BIT_SOC_CAN1_EN: 1;
            __IO uint32_t BIT_SOC_JPEG_EN: 1;
            __IO uint32_t BIT_SOC_GMAC_EN: 1;
            __IO uint32_t BIT_SOC_ZIGBEE_EN: 1;
            __IO uint32_t BIT_SOC_TIMER1_DEB_EN: 1;
        } BITS_210;
    } u_210;

    /* 0x0214       0x4000_0214
        2:0     R/W    sdio0_clk_div                           3'h0
        3       R/W    sdio0_clk_div_en                        1'h0
        4       R/W    sdio0_clk_src_en                        1'h0
        5       R/W    sdio0_clk_sel0                          1'h0
        6       R/W    sdio0_clk_sel1                          1'h0
        7       R/W    RESERVED141                             1'h0
        10:8    R/W    DISP_CLK_DIV                            3'h0
        11      R/W    DISP_CLK_DIV_EN                         1'h0
        12      R/W    DISP_CLK_SRC_EN                         1'h0
        13      R/W    DISP_CLK_SEL0                           1'h0
        14      R/W    DISP_CLK_SEL1                           1'h0
        15      R/W    DISP_PLL_CLK_SEL                        1'h0
        18:16   R/W    GMAC_CLK_125M_DIV                       1'h0
        19      R/W    GMAC_CLK_125M_DIV_EN                    1'h0
        20      R/W    GMAC_CLK_125M_CLK_SRC_EN                1'h0
        21      R/W    GMAC_CLK_125M_CLK_SEL                   1'h0
        23:22   R/W    RESERVED130                             2'h0
        26:24   R/W    GMAC_CLK_50M_DIV                        1'h0
        27      R/W    GMAC_CLK_50M_DIV_EN                     1'h0
        28      R/W    GMAC_CLK_50M_CLK_SRC_EN                 1'h0
        29      R/W    GMAC_CLK_50M_CLK_SEL                    1'h0
        31:30   R/W    RESERVED125                             16'h0
    */
    union
    {
        __IO uint32_t REG_0x0214;
        struct
        {
            __IO uint32_t sdio0_clk_div: 3;
            __IO uint32_t sdio0_clk_div_en: 1;
            __IO uint32_t sdio0_clk_src_en: 1;
            __IO uint32_t sdio0_clk_sel0: 1;
            __IO uint32_t sdio0_clk_sel1: 1;
            __IO uint32_t RESERVED141: 1;
            __IO uint32_t DISP_CLK_DIV: 3;
            __IO uint32_t DISP_CLK_DIV_EN: 1;
            __IO uint32_t DISP_CLK_SRC_EN: 1;
            __IO uint32_t DISP_CLK_SEL0: 1;
            __IO uint32_t DISP_CLK_SEL1: 1;
            __IO uint32_t DISP_PLL_CLK_SEL: 1;
            __IO uint32_t GMAC_CLK_125M_DIV: 3;
            __IO uint32_t GMAC_CLK_125M_DIV_EN: 1;
            __IO uint32_t GMAC_CLK_125M_CLK_SRC_EN: 1;
            __IO uint32_t GMAC_CLK_125M_CLK_SEL: 1;
            __IO uint32_t RESERVED130: 2;
            __IO uint32_t GMAC_CLK_50M_DIV: 3;
            __IO uint32_t GMAC_CLK_50M_DIV_EN: 1;
            __IO uint32_t GMAC_CLK_50M_CLK_SRC_EN: 1;
            __IO uint32_t GMAC_CLK_50M_CLK_SEL: 1;
            __IO uint32_t RESERVED125: 2;
        } BITS_214;
    } u_214;

    /* 0x0218       0x4000_0218
        1:0     R/W    RESERVED175                             2'h0
        2       R/W    BIT_PERI_AES_EN                         1'h0
        3       R/W    BIT_PERI_RNG_EN                         1'h0
        4       R/W    BIT_PERI_SIMC_EN                        1'h0
        5       R/W    BIT_PERI_LCD_EN                         1'h0
        6       R/W    BIT_PERI_SHA256_EN                      1'h0
        7       R/W    BIT_PERI_SM3_EN                         1'h0
        8       R/W    BIT_PERI_SPI0_EN                        1'h0
        9       R/W    BIT_PERI_SPI1_EN                        1'h0
        10      R/W    BIT_PERI_IRRC_EN                        1'h0
        11      R/W    BIT_PERI_SPI2_EN                        1'h0
        15:12   R/W    RESERVED164                             4'h0
        16      R/W    BIT_PERI_I2C0_EN                        1'h0
        17      R/W    BIT_PERI_I2C1_EN                        1'h0
        18      R/W    BIT_PERI_QDEC_EN                        1'h0
        19      R/W    BIT_PERI_KEYSCAN_EN                     1'h0
        20      R/W    BIT_PERI_I2C2_EN                        1'h0
        21      R/W    RESERVED158                             1'h0
        22      R/W    BIT_PERI_PSRAM1_EN                      1'h0
        23      R/W    BIT_PERI_PSRAM3_EN                      1'h0
        24      R/W    BIT_PERI_SPI0_S_EN                      1'h0
        25      R/W    BIT_DSP_CORE_EN                         1'b1
        26      R/W    BIT_DSP_H2D_D2H                         1'b1
        27      R/W    BIT_DSP_MEM_EN                          1'b1
        28      R/W    BIT_ASRC_EN                             1'h0
        29      R/W    BIT_DSP_WDT_EN                          1'h0
        30      R/W    BIT_EFUSE_EN                            1'h0
        31      R/W    BIT_DATA_MEM_EN                         1'h0
    */
    union
    {
        __IO uint32_t SOC_PERI_FUNC0_EN;
        struct
        {
            __IO uint32_t RESERVED175: 2;
            __IO uint32_t BIT_PERI_AES_EN: 1;
            __IO uint32_t BIT_PERI_RNG_EN: 1;
            __IO uint32_t BIT_PERI_SIMC_EN: 1;
            __IO uint32_t BIT_PERI_LCD_EN: 1;
            __IO uint32_t BIT_PERI_SHA256_EN: 1;
            __IO uint32_t BIT_PERI_SM3_EN: 1;
            __IO uint32_t BIT_PERI_SPI0_EN: 1;
            __IO uint32_t BIT_PERI_SPI1_EN: 1;
            __IO uint32_t BIT_PERI_IRRC_EN: 1;
            __IO uint32_t BIT_PERI_SPI2_EN: 1;
            __IO uint32_t RESERVED164: 4;
            __IO uint32_t BIT_PERI_I2C0_EN: 1;
            __IO uint32_t BIT_PERI_I2C1_EN: 1;
            __IO uint32_t BIT_PERI_QDEC_EN: 1;
            __IO uint32_t BIT_PERI_KEYSCAN_EN: 1;
            __IO uint32_t BIT_PERI_I2C2_EN: 1;
            __IO uint32_t RESERVED158: 1;
            __IO uint32_t BIT_PERI_PSRAM1_EN: 1;
            __IO uint32_t BIT_PERI_PSRAM3_EN: 1;
            __IO uint32_t BIT_PERI_SPI0_S_EN: 1;
            __IO uint32_t BIT_DSP_CORE_EN: 1;
            __IO uint32_t BIT_DSP_H2D_D2H: 1;
            __IO uint32_t BIT_DSP_MEM_EN: 1;
            __IO uint32_t BIT_ASRC_EN: 1;
            __IO uint32_t BIT_DSP_WDT_EN: 1;
            __IO uint32_t BIT_EFUSE_EN: 1;
            __IO uint32_t BIT_DATA_MEM_EN: 1;
        } BITS_218;
    } u_218;

    /* 0x021C       0x4000_021c
        0       R/W    BIT_PERI_ADC_EN                         1'h0
        7:1     R/W    RESERVED184                             7'h0
        8       R/W    BIT_PERI_GPIO_EN                        1'h0
        9       R/W    BIT_PERI_GPIO1_EN                       1'h0
        10      R/W    BIT_SOC_TIMER1_6_PWM_EN                 1'h0
        11      R/W    BIT_SOC_TIMER1_7_PWM_EN                 1'h0
        12      R/W    BIT_SOC_TIMER1_8_PWM_EN                 1'h0
        13      R/W    BIT_SOC_TIMER1_9_PWM_EN                 1'h0
        31:14   R/W    RESERVED177                             18'h0
    */
    union
    {
        __IO uint32_t SOC_PERI_FUNC1_EN;
        struct
        {
            __IO uint32_t BIT_PERI_ADC_EN: 1;
            __IO uint32_t RESERVED184: 7;
            __IO uint32_t BIT_PERI_GPIO_EN: 1;
            __IO uint32_t BIT_PERI_GPIO1_EN: 1;
            __IO uint32_t BIT_SOC_TIMER1_6_PWM_EN: 1;
            __IO uint32_t BIT_SOC_TIMER1_7_PWM_EN: 1;
            __IO uint32_t BIT_SOC_TIMER1_8_PWM_EN: 1;
            __IO uint32_t BIT_SOC_TIMER1_9_PWM_EN: 1;
            __IO uint32_t RESERVED177: 18;
        } BITS_21C;
    } u_21C;

    /* 0x0220       0x4000_0220
        0       R/W    RESERVED200                             1'h0
        1       R/W    r_PON_FEN_SPORT0                        1'h0
        2       R/W    r_PON_FEN_SPORT1                        1'h0
        3       R/W    RESERVED197                             1'h0
        4       R/W    RESERVED196                             1'h0
        5       R/W    r_CLK_EN_SPORT0                         1'h0
        6       R/W    r_CLK_EN_SPORT1                         1'h0
        7       R/W    RESERVED193                             1'h0
        8       R/W    r_CLK_EN_SPORT_40M                      1'h0
        9       R/W    RESERVED191                             1'h1
        10      R/W    r_PON_FEN_SPORT2                        1'h1
        11      R/W    RESERVED189                             1'h0
        12      R/W    r_CLK_EN_SPORT2                         1'h1
        31:13   R/W    RESERVED187                             19'h0
    */
    union
    {
        __IO uint32_t SOC_AUDIO_IF_EN;
        struct
        {
            __IO uint32_t RESERVED200: 1;
            __IO uint32_t r_PON_FEN_SPORT0: 1;
            __IO uint32_t r_PON_FEN_SPORT1: 1;
            __IO uint32_t RESERVED197: 1;
            __IO uint32_t RESERVED196: 1;
            __IO uint32_t r_CLK_EN_SPORT0: 1;
            __IO uint32_t r_CLK_EN_SPORT1: 1;
            __IO uint32_t RESERVED193: 1;
            __IO uint32_t r_CLK_EN_SPORT_40M: 1;
            __IO uint32_t RESERVED191: 1;
            __IO uint32_t r_PON_FEN_SPORT2: 1;
            __IO uint32_t RESERVED189: 1;
            __IO uint32_t r_CLK_EN_SPORT2: 1;
            __IO uint32_t RESERVED187: 19;
        } BITS_220;
    } u_220;

    /* 0x0224       0x4000_0224
        2:0     R/W    r_SPORT0_PLL_CLK_SEL                    3'b100
        3       R/W    r_SPORT0_EXT_CODEC                      1'h0
        6:4     R/W    r_SPORT1_PLL_CLK_SEL                    3'b001
        7       R/W    RESERVED208                             1'h0
        15:8    R/W    r_PLL_DIV0_SETTING                      8'h0
        23:16   R/W    r_PLL_DIV1_SETTING                      8'h0
        24      R/W    R_SPORT0_PLL_SRC_CLK_SEL                1'h0
        25      R/W    R_SPORT1_PLL_SRC_CLK_SEL                1'h0
        26      R/W    R_SPORT2_PLL_SRC_CLK_SEL                1'h0
        31:27   R/W    RESERVED202                             5'h0
    */
    union
    {
        __IO uint32_t SOC_AUDIO_CLK_CTRL_A;
        struct
        {
            __IO uint32_t r_SPORT0_PLL_CLK_SEL: 3;
            __IO uint32_t r_SPORT0_EXT_CODEC: 1;
            __IO uint32_t r_SPORT1_PLL_CLK_SEL: 3;
            __IO uint32_t RESERVED208: 1;
            __IO uint32_t r_PLL_DIV0_SETTING: 8;
            __IO uint32_t r_PLL_DIV1_SETTING: 8;
            __IO uint32_t R_SPORT0_PLL_SRC_CLK_SEL: 1;
            __IO uint32_t R_SPORT1_PLL_SRC_CLK_SEL: 1;
            __IO uint32_t R_SPORT2_PLL_SRC_CLK_SEL: 1;
            __IO uint32_t RESERVED202: 5;
        } BITS_224;
    } u_224;

    /* 0x0228       0x4000_0228
        2:0     R/W    RESERVED225                             3'h1
        3       R/W    r_SPORT0_MCLK_OUT                       1'h0
        4       R/W    r_SPORT1_MCLK_OUT                       1'h0
        5       R/W    r_SPORT2_MCLK_OUT                       1'h0
        6       R/W    RESERVED221                             1'h0
        7       R/W    RESERVED220                             1'h0
        8       R/W    r_SPORT1_EXT_CODEC                      1'h0
        12:9    R/W    RESERVED218                             4'b0
        15:13   R/W    r_SPORT2_PLL_CLK_SEL                    3'b0
        18:16   R/W    RESERVED216                             3'b0
        19      R/W    r_SPORT2_EXT_CODEC                      1'h0
        23:20   R/W    RESERVED214                             4'b0
        31:24   R/W    R_PLL_DIV2_SETTING                      8'b0
    */
    union
    {
        __IO uint32_t SOC_AUDIO_CLK_CTRL_B;
        struct
        {
            __IO uint32_t RESERVED225: 3;
            __IO uint32_t r_SPORT0_MCLK_OUT: 1;
            __IO uint32_t r_SPORT1_MCLK_OUT: 1;
            __IO uint32_t r_SPORT2_MCLK_OUT: 1;
            __IO uint32_t RESERVED221: 1;
            __IO uint32_t RESERVED220: 1;
            __IO uint32_t r_SPORT1_EXT_CODEC: 1;
            __IO uint32_t RESERVED218: 4;
            __IO uint32_t r_SPORT2_PLL_CLK_SEL: 3;
            __IO uint32_t RESERVED216: 3;
            __IO uint32_t r_SPORT2_EXT_CODEC: 1;
            __IO uint32_t RESERVED214: 4;
            __IO uint32_t R_PLL_DIV2_SETTING: 8;
        } BITS_228;
    } u_228;

