wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x022C       0x4000_022c
        1:0     R/W    S4_CLK_DIV                              2'h1
        2       R/W    S4_CLK_SRC_EN                           1'h1
        4:3     R/W    S5_CLK_DIV                              2'h1
        5       R/W    S5_CLK_SRC_EN                           1'h1
        7:6     R/W    S6_CLK_DIV                              2'h1
        8       R/W    S6_CLK_SRC_EN                           1'h1
        10:9    R/W    S7_CLK_DIV                              2'h1
        11      R/W    S7_CLK_SRC_EN                           1'h1
        13:12   R/W    S9_CLK_DIV                              2'h1
        14      R/W    S9_CLK_SRC_EN                           1'h1
        31:15   R      RESERVED227                             17'h0
    */
    union
    {
        __IO uint32_t REG_0x022C;
        struct
        {
            __IO uint32_t S4_CLK_DIV: 2;
            __IO uint32_t S4_CLK_SRC_EN: 1;
            __IO uint32_t S5_CLK_DIV: 2;
            __IO uint32_t S5_CLK_SRC_EN: 1;
            __IO uint32_t S6_CLK_DIV: 2;
            __IO uint32_t S6_CLK_SRC_EN: 1;
            __IO uint32_t S7_CLK_DIV: 2;
            __IO uint32_t S7_CLK_SRC_EN: 1;
            __IO uint32_t S9_CLK_DIV: 2;
            __IO uint32_t S9_CLK_SRC_EN: 1;
            __I uint32_t RESERVED227: 17;
        } BITS_22C;
    } u_22C;

    /* 0x0230       0x4000_0230
        0       R/W    R_CKE_GPIO0_DEB                         1'h1
        1       R/W    R_CKE_GPIO1_DEB                         1'h0
        2       R/W    BIT_SOC_CKE_PLFM                        1'h1
        3       R/W    r_CKE_CTRLAP                            1'h1
        4       R/W    BIT_CKE_BUS_RAM_SLP                     1'h0
        5       R/W    BIT_CKE_BT_VEN                          1'h1
        6       R/W    BIT_SOC_ACTCK_VENDOR_REG_EN             1'h0
        7       R/W    BIT_SOC_SLPCK_VENDOR_REG_EN             1'h0
        8       R/W    BIT_SOC_ACTCK_FLASH_EN                  1'h1
        9       R/W    BIT_SOC_SLPCK_FLASH_EN                  1'h0
        10      R/W    BIT_SOC_ACTCK_AHBC_EN                   1'h1
        11      R/W    BIT_SOC_SLPCK_AHBC_EN                   1'h1
        12      R/W    BIT_SOC_ACTCK_FLASH3_EN                 1'h0
        13      R/W    BIT_SOC_SLPCK_FLASH3_EN                 1'h0
        14      R/W    BIT_SOC_ACTCK_TIMER0_EN                 1'h0
        15      R/W    BIT_SOC_SLPCK_TIMER0_EN                 1'h0
        16      R/W    BIT_SOC_ACTCK_GDMA0_EN                  1'h0
        17      R/W    BIT_SOC_SLPCK_GDMA0_EN                  1'h0
        18      R/W    BIT_SOC_ACTCK_FLASH1_EN                 1'h0
        19      R/W    BIT_SOC_SLPCK_FLASH1_EN                 1'h0
        20      R/W    BIT_SOC_ACTCK_FLASH2_EN                 1'h0
        21      R/W    BIT_SOC_SLPCK_FLASH2_EN                 1'h0
        22      R/W    BIT_SOC_ACTCK_GPIO1_EN                  1'h0
        23      R/W    BIT_SOC_SLPCK_GPIO1_EN                  1'h0
        24      R/W    BIT_SOC_ACTCK_GPIO_EN                   1'h0
        25      R/W    BIT_SOC_SLPCK_GPIO_EN                   1'h0
        26      R/W    BIT_SOC_ACTCK_SDH0_EN                   1'h0
        27      R/W    BIT_SOC_SLPCK_SDH0_EN                   1'h0
        28      R/W    BIT_SOC_ACTCK_SDH1_EN                   1'h0
        29      R/W    BIT_SOC_SLPCK_SDH1_EN                   1'h0
        31:30   R/W    RESERVED239                             2'h0
    */
    union
    {
        __IO uint32_t PESOC_CLK_CTRL;
        struct
        {
            __IO uint32_t R_CKE_GPIO0_DEB: 1;
            __IO uint32_t R_CKE_GPIO1_DEB: 1;
            __IO uint32_t BIT_SOC_CKE_PLFM: 1;
            __IO uint32_t r_CKE_CTRLAP: 1;
            __IO uint32_t BIT_CKE_BUS_RAM_SLP: 1;
            __IO uint32_t BIT_CKE_BT_VEN: 1;
            __IO uint32_t BIT_SOC_ACTCK_VENDOR_REG_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_VENDOR_REG_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_FLASH_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_FLASH_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_AHBC_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_AHBC_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_FLASH3_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_FLASH3_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_TIMER0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_TIMER0_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_GDMA0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_GDMA0_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_FLASH1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_FLASH1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_FLASH2_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_FLASH2_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_GPIO1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_GPIO1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_GPIO_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_GPIO_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_SDH0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_SDH0_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_SDH1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_SDH1_EN: 1;
            __IO uint32_t RESERVED239: 2;
        } BITS_230;
    } u_230;

    /* 0x0234       0x4000_0234
        0       R/W    BIT_SOC_ACTCK_2P4G                      1'h0
        1       R/W    BIT_SOC_SLPCK_2P4G                      1'h0
        2       R/W    BIT_SOC_ACTCK_SPI0_S                    1'h0
        3       R/W    BIT_SOC_SLPCK_SPI0_S                    1'h0
        4       R/W    BIT_CKE_MODEM                           1'h1
        5       R/W    BIT_CKE_CAL32K                          1'h0
        6       R/W    BIT_CKE_SWR_SS                          1'h0
        7       R/W    RESERVED295                             1'h0
        8       R/W    BIT_CKE_RNG                             1'h0
        9       R/W    BIT_CKE_PDCK                            1'h0
        10      R/W    BIT_CKE_AAC_XTAL                        1'h0
        11      R/W    BIT_CKE_SHA256                          1'h0
        12      R/W    BIT_CKE_SM3                             1'h0
        13      R/W    BIT_CKE_GMAC                            1'h0
        14      R/W    BIT_SOC_ACTCK_TIMER1                    1'h0
        15      R/W    BIT_SOC_SLPCK_TIMER1                    1'h0
        16      R/W    BIT_SOC_ACTCK_SPI0_EN                   1'h0
        17      R/W    BIT_SOC_SLPCK_SPI0_EN                   1'h0
        18      R/W    BIT_SOC_ACTCK_SPI1_EN                   1'h0
        19      R/W    BIT_SOC_SLPCK_SPI1_EN                   1'h0
        20      R/W    BIT_SOC_ACTCK_IRRC                      1'h0
        21      R/W    BIT_SOC_SLPCK_IRRC                      1'h0
        22      R/W    BIT_SOC_ACTCK_SPI2_EN                   1'h0
        23      R/W    BIT_SOC_SLPCK_SPI2_EN                   1'h0
        24      R/W    BIT_SOC_ACTCK_CAN0                      1'h0
        25      R/W    BIT_SOC_SLPCK_CAN0                      1'h0
        26      R/W    BIT_SOC_ACTCK_PPE                       1'h0
        27      R/W    BIT_SOC_SLPCK_PPE                       1'h0
        28      R/W    BIT_SOC_ACTCK_PKE                       1'h0
        29      R/W    BIT_SOC_SLPCK_PKE                       1'h0
        30      R/W    BIT_SOC_ACTCK_RTZIP                     1'h0
        31      R/W    BIT_SOC_SLPCK_RTZIP                     1'h0
    */
    union
    {
        __IO uint32_t PESOC_PERI_CLK_CTRL0;
        struct
        {
            __IO uint32_t BIT_SOC_ACTCK_2P4G: 1;
            __IO uint32_t BIT_SOC_SLPCK_2P4G: 1;
            __IO uint32_t BIT_SOC_ACTCK_SPI0_S: 1;
            __IO uint32_t BIT_SOC_SLPCK_SPI0_S: 1;
            __IO uint32_t BIT_CKE_MODEM: 1;
            __IO uint32_t BIT_CKE_CAL32K: 1;
            __IO uint32_t BIT_CKE_SWR_SS: 1;
            __IO uint32_t RESERVED295: 1;
            __IO uint32_t BIT_CKE_RNG: 1;
            __IO uint32_t BIT_CKE_PDCK: 1;
            __IO uint32_t BIT_CKE_AAC_XTAL: 1;
            __IO uint32_t BIT_CKE_SHA256: 1;
            __IO uint32_t BIT_CKE_SM3: 1;
            __IO uint32_t BIT_CKE_GMAC: 1;
            __IO uint32_t BIT_SOC_ACTCK_TIMER1: 1;
            __IO uint32_t BIT_SOC_SLPCK_TIMER1: 1;
            __IO uint32_t BIT_SOC_ACTCK_SPI0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_SPI0_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_SPI1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_SPI1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_IRRC: 1;
            __IO uint32_t BIT_SOC_SLPCK_IRRC: 1;
            __IO uint32_t BIT_SOC_ACTCK_SPI2_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_SPI2_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_CAN0: 1;
            __IO uint32_t BIT_SOC_SLPCK_CAN0: 1;
            __IO uint32_t BIT_SOC_ACTCK_PPE: 1;
            __IO uint32_t BIT_SOC_SLPCK_PPE: 1;
            __IO uint32_t BIT_SOC_ACTCK_PKE: 1;
            __IO uint32_t BIT_SOC_SLPCK_PKE: 1;
            __IO uint32_t BIT_SOC_ACTCK_RTZIP: 1;
            __IO uint32_t BIT_SOC_SLPCK_RTZIP: 1;
        } BITS_234;
    } u_234;

    /* 0x0238       0x4000_0238
        0       R/W    BIT_SOC_ACTCK_I2C0_EN                   1'h0
        1       R/W    BIT_SOC_SLPCK_I2C0_EN                   1'h0
        2       R/W    BIT_SOC_ACTCK_I2C1_EN                   1'h0
        3       R/W    BIT_SOC_SLPCK_I2C1_EN                   1'h0
        4       R/W    BIT_SOC_ACTCK_QDEC_EN                   1'h0
        5       R/W    BIT_SOC_SLPCK_QDEC_EN                   1'h0
        6       R/W    BIT_SOC_ACTCK_KEYSCAN_EN                1'h0
        7       R/W    BIT_SOC_SLPCK_KEYSCAN_EN                1'h0
        8       R/W    BIT_SOC_ACTCK_AES_EN                    1'h0
        9       R/W    BIT_SOC_SLPCK_AES_EN                    1'h0
        10      R/W    BIT_SOC_ACTCK_SIMC_EN                   1'h0
        11      R/W    BIT_SOC_SLPCK_SIMC_EN                   1'h0
        12      R/W    BIT_SOC_ACTCK_I2C2_EN                   1'h0
        13      R/W    BIT_SOC_SLPCK_I2C2_EN                   1'h0
        14      R/W    BIT_SOC_ACTCK_DATA_MEM0_EN              1'h0
        15      R/W    BIT_SOC_SLPCK_DATA_MEM0_EN              1'h0
        16      R/W    BIT_SOC_ACTCK_DATA_MEM1_EN              1'h0
        17      R/W    BIT_SOC_SLPCK_DATA_MEM1_EN              1'h0
        18      R/W    BIT_SOC_ACTCK_LCD_EN                    1'h0
        19      R/W    BIT_SOC_SLPCK_LCD_EN                    1'h0
        20      R/W    BIT_SOC_ACTCKE_ASRC                     1'h0
        21      R/W    BIT_SOC_SLPCKE_ASRC                     1'h0
        22      R/W    BIT_SOC_ACTCKE_DSP_MEM                  1'h0
        23      R/W    BIT_SOC_SLPCKE_DSP_MEM                  1'h0
        24      R/W    BIT_SOC_ACTCK_ADC_EN                    1'h0
        25      R/W    BIT_SOC_SLPCK_ADC_EN                    1'h0
        26      R/W    BIT_SOC_ACTCKE_H2D_D2H                  1'h0
        27      R/W    BIT_SOC_SLPCKE_H2D_D2H                  1'h0
        28      R/W    BIT_SOC_ACTCKE_DSP                      1'h0
        29      R/W    BIT_SOC_SLPCKE_DSP                      1'h0
        30      R/W    BIT_SOC_CKE_DSP_WDT                     1'h0
        31      R/W    BIT_SOC_CLK_EFUSE                       1'h0
    */
    union
    {
        __IO uint32_t PESOC_PERI_CLK_CTRL1;
        struct
        {
            __IO uint32_t BIT_SOC_ACTCK_I2C0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_I2C0_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_I2C1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_I2C1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_QDEC_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_QDEC_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_KEYSCAN_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_KEYSCAN_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_AES_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_AES_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_SIMC_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_SIMC_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_I2C2_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_I2C2_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_DATA_MEM0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_DATA_MEM0_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_DATA_MEM1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_DATA_MEM1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_LCD_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_LCD_EN: 1;
            __IO uint32_t BIT_SOC_ACTCKE_ASRC: 1;
            __IO uint32_t BIT_SOC_SLPCKE_ASRC: 1;
            __IO uint32_t BIT_SOC_ACTCKE_DSP_MEM: 1;
            __IO uint32_t BIT_SOC_SLPCKE_DSP_MEM: 1;
            __IO uint32_t BIT_SOC_ACTCK_ADC_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_ADC_EN: 1;
            __IO uint32_t BIT_SOC_ACTCKE_H2D_D2H: 1;
            __IO uint32_t BIT_SOC_SLPCKE_H2D_D2H: 1;
            __IO uint32_t BIT_SOC_ACTCKE_DSP: 1;
            __IO uint32_t BIT_SOC_SLPCKE_DSP: 1;
            __IO uint32_t BIT_SOC_CKE_DSP_WDT: 1;
            __IO uint32_t BIT_SOC_CLK_EFUSE: 1;
        } BITS_238;
    } u_238;

    /* 0x023C       0x4000_023c
        0       R/W    r_epalna_od                             1'h0
        1       R/W    r_spic_dbg_dis                          1'h0
        4:2     R/W    r_SPIC_MON_SEL                          3'h0
        11:5    R/W    RESERVED357                             7'h0
        12      R/W    BIT_SOC_ACTCK_CAN2_EN                   1'h0
        13      R/W    BIT_SOC_SLPCK_CAN2_EN                   1'h0
        14      R/W    BIT_SOC_ACTCK_ZIGBEE_EN                 1'h0
        15      R/W    BIT_SOC_SLPCK_ZIGBEE_EN                 1'h0
        16      R/W    BIT_SOC_ACTCK_JPEG_EN                   1'h0
        17      R/W    BIT_SOC_SLPCK_JPEG_EN                   1'h0
        18      R/W    BIT_SOC_ACTCK_UART0_EN                  1'h0
        19      R/W    BIT_SOC_SLPCK_UART0_EN                  1'h0
        20      R/W    BIT_SOC_ACTCK_UART1_EN                  1'h0
        21      R/W    BIT_SOC_SLPCK_UART1_EN                  1'h0
        22      R/W    BIT_SOC_ACTCK_UART2_EN                  1'h0
        23      R/W    BIT_SOC_SLPCK_UART2_EN                  1'h0
        24      R/W    BIT_SOC_ACTCK_UART3_EN                  1'h0
        25      R/W    BIT_SOC_SLPCK_UART3_EN                  1'h0
        26      R/W    BIT_SOC_ACTCK_UART4_EN                  1'h0
        27      R/W    BIT_SOC_SLPCK_UART4_EN                  1'h0
        28      R/W    BIT_SOC_ACTCK_UART5_EN                  1'h0
        29      R/W    BIT_SOC_SLPCK_UART5_EN                  1'h0
        30      R/W    BIT_SOC_ACTCK_CAN1_EN                   1'h0
        31      R/W    BIT_SOC_SLPCK_CAN1_EN                   1'h0
    */
    union
    {
        __IO uint32_t REG_TESTMODE_SEL_RF;
        struct
        {
            __IO uint32_t r_epalna_od: 1;
            __IO uint32_t r_spic_dbg_dis: 1;
            __IO uint32_t r_SPIC_MON_SEL: 3;
            __IO uint32_t RESERVED357: 7;
            __IO uint32_t BIT_SOC_ACTCK_CAN2_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_CAN2_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_ZIGBEE_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_ZIGBEE_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_JPEG_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_JPEG_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_UART0_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_UART0_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_UART1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_UART1_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_UART2_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_UART2_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_UART3_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_UART3_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_UART4_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_UART4_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_UART5_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_UART5_EN: 1;
            __IO uint32_t BIT_SOC_ACTCK_CAN1_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_CAN1_EN: 1;
        } BITS_23C;
    } u_23C;

    /* 0x0240       0x4000_0240
        0       R/W    CLK_ZB_MBIST_EN                         1'h0
        31:1    R      RESERVED362                             31'h0
    */
    union
    {
        __IO uint32_t REG_0x0240;
        struct
        {
            __IO uint32_t CLK_ZB_MBIST_EN: 1;
            __I uint32_t RESERVED362: 31;
        } BITS_240;
    } u_240;

    /* 0x0244       0x4000_0244
        0       R/W    BIT_SOC_ACTCK_BTBUS_EN                  1'h1
        1       R/W    BIT_SOC_SLPCK_BTBUS_EN                  1'h1
        31:2    R/W    RESERVED365                             30'h0
    */
    union
    {
        __IO uint32_t OFF_MEM_PWR_CTRL;
        struct
        {
            __IO uint32_t BIT_SOC_ACTCK_BTBUS_EN: 1;
            __IO uint32_t BIT_SOC_SLPCK_BTBUS_EN: 1;
            __IO uint32_t RESERVED365: 30;
        } BITS_244;
    } u_244;

    /* 0x0248       0x4000_0248
        7:0     R/W    RESERVED371                             8'h0
        10:8    R/W    r_swr_ss_div_sel                        3'h0
        31:11   R/W    RESERVED369                             21'h0
    */
    union
    {
        __IO uint32_t REG_0x248;
        struct
        {
            __IO uint32_t RESERVED371: 8;
            __IO uint32_t r_swr_ss_div_sel: 3;
            __IO uint32_t RESERVED369: 21;
        } BITS_248;
    } u_248;

    /* 0x024C       0x4000_024c
        6:0     R/W    r_pro_ahb_wait_cnt                      7'b0010001
        31:7    R      RESERVED373                             25'h0
    */
    union
    {
        __IO uint32_t REG_0x024C;
        struct
        {
            __IO uint32_t r_pro_ahb_wait_cnt: 7;
            __I uint32_t RESERVED373: 25;
        } BITS_24C;
    } u_24C;

    /* 0x0250       0x4000_0250
        0       R/W    spic0_clk_en_opt                        1'h0
        1       R/W    spic1_clk_en_opt                        1'h0
        2       R/W    spic2_clk_en_opt                        1'h0
        3       R/W    spic3_clk_en_opt                        1'h0
        4       R/W    spic0_spi_busy_r_opt                    1'h0
        5       R/W    spic1_spi_busy_r_opt                    1'h0
        6       R/W    spic2_spi_busy_r_opt                    1'h0
        7       R/W    spic3_spi_busy_r_opt                    1'h0
        31:8    R      RESERVED376                             24'h0
    */
    union
    {
        __IO uint32_t REG_0x0250;
        struct
        {
            __IO uint32_t spic0_clk_en_opt: 1;
            __IO uint32_t spic1_clk_en_opt: 1;
            __IO uint32_t spic2_clk_en_opt: 1;
            __IO uint32_t spic3_clk_en_opt: 1;
            __IO uint32_t spic0_spi_busy_r_opt: 1;
            __IO uint32_t spic1_spi_busy_r_opt: 1;
            __IO uint32_t spic2_spi_busy_r_opt: 1;
            __IO uint32_t spic3_spi_busy_r_opt: 1;
            __I uint32_t RESERVED376: 24;
        } BITS_250;
    } u_250;

    /* 0x0254       0x4000_0254
        0       R/W    DSP_RUN_STALL                           1'h1
        1       R/W    DSP_STAT_VECTOR_SEL                     1'h0
        2       R/W    RESERVED397                             1'h0
        14:3    R/W    DUMMY                                   12'h0
        15      R/W    RESERVED395                             1'h0
        19:16   R/W    r_cpu_low_rate_valid_num1               4'h3
        23:20   R/W    r_dsp_low_rate_valid_num1               4'h3
        24      R/W    r_cpu_auto_slow_filter1_en              1'h0
        25      R/W    r_dsp_auto_slow_filter1_en              1'h0
        27:26   R/W    RESERVED390                             2'h0
        28      R/W    r_peri_bt_free_cnt_en                   1'h0
        29      R/W    r_peri_clk_bt_free_cnt_en               1'h0
        30      R      RESERVED387                             1'h0
        31      R      RESERVED386                             1'h0
    */
    union
    {
        __IO uint32_t REG_0x254;
        struct
        {
            __IO uint32_t DSP_RUN_STALL: 1;
            __IO uint32_t DSP_STAT_VECTOR_SEL: 1;
            __IO uint32_t RESERVED397: 1;
            __IO uint32_t RESERVED_0: 12;
            __IO uint32_t RESERVED395: 1;
            __IO uint32_t r_cpu_low_rate_valid_num1: 4;
            __IO uint32_t r_dsp_low_rate_valid_num1: 4;
            __IO uint32_t r_cpu_auto_slow_filter1_en: 1;
            __IO uint32_t r_dsp_auto_slow_filter1_en: 1;
            __IO uint32_t RESERVED390: 2;
            __IO uint32_t r_peri_bt_free_cnt_en: 1;
            __IO uint32_t r_peri_clk_bt_free_cnt_en: 1;
            __I uint32_t RESERVED387: 1;
            __I uint32_t RESERVED386: 1;
        } BITS_254;
    } u_254;

    /* 0x0258       0x4000_0258
        1:0     R/W    CORE0_TUNE_OCP_RES                      2'h0
        4:2     R/W    CORE0_TUNE_PWM_R3                       3'h0
        7:5     R/W    CORE0_TUNE_PWM_R2                       3'h0
        10:8    R/W    CORE0_TUNE_PWM_R1                       3'h0
        13:11   R/W    CORE0_TUNE_PWM_C3                       3'h0
        16:14   R/W    CORE0_TUNE_PWM_C2                       3'h0
        19:17   R/W    CORE0_TUNE_PWM_C1                       3'h0
        20      R/W    CORE0_BYPASS_PWM_BYPASS_RoughSS         1'h0
        22:21   R/W    CORE0_BYPASS_PWM_TUNE_RoughSS           2'h0
        25:23   R/W    CORE0_BYPASS_PWM_TUNE_VCL               3'h0
        28:26   R/W    CORE0_BYPASS_PWM_TUNE_VCH               3'h0
        29      R/W    CORE0_X4_PWM_COMP_IB                    1'h0
        30      R/W    CORE0_X4_POW_PWM_CLP                    1'h0
        31      R/W    CORE0_X4_TUNE_VDIV_Bit0                 1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR0_31_0;
        struct
        {
            __IO uint32_t CORE0_TUNE_OCP_RES: 2;
            __IO uint32_t CORE0_TUNE_PWM_R3: 3;
            __IO uint32_t CORE0_TUNE_PWM_R2: 3;
            __IO uint32_t CORE0_TUNE_PWM_R1: 3;
            __IO uint32_t CORE0_TUNE_PWM_C3: 3;
            __IO uint32_t CORE0_TUNE_PWM_C2: 3;
            __IO uint32_t CORE0_TUNE_PWM_C1: 3;
            __IO uint32_t CORE0_BYPASS_PWM_BYPASS_RoughSS: 1;
            __IO uint32_t CORE0_BYPASS_PWM_TUNE_RoughSS: 2;
            __IO uint32_t CORE0_BYPASS_PWM_TUNE_VCL: 3;
            __IO uint32_t CORE0_BYPASS_PWM_TUNE_VCH: 3;
            __IO uint32_t CORE0_X4_PWM_COMP_IB: 1;
            __IO uint32_t CORE0_X4_POW_PWM_CLP: 1;
            __IO uint32_t CORE0_X4_TUNE_VDIV_Bit0: 1;
        } BITS_258;
    } u_258;

