wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x025C       0x4000_025c
        6:0     R/W    CORE0_X4_TUNE_VDIV_Bit7_Bit1            7'h0
        14:7    R/W    CORE0_BYPASS_PWM_TUNE_POS_VREFPFM       8'h0
        17:15   R/W    CORE0_BYPASS_PWM_TUNE_POS_VREFOCP       3'h0
        18      R/W    CORE0_FPWM                              1'h0
        19      R/W    CORE0_POW_PFM                           1'h0
        20      R/W    CORE0_POW_PWM                           1'h0
        21      R/W    CORE0_POW_VDIV                          1'h0
        23:22   R/W    CORE0_XTAL_OV_RATIO                     2'h0
        26:24   R/W    CORE0_XTAL_OV_UNIT                      3'h0
        29:27   R/W    CORE0_XTAL_OV_MODE                      3'h0
        30      R/W    CORE0_EN_POWERMOS_DR8X                  1'h0
        31      R/W    CORE0_SEL_OCP_TABLE                     1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR0_63_32;
        struct
        {
            __IO uint32_t CORE0_X4_TUNE_VDIV_Bit7_Bit1: 7;
            __IO uint32_t CORE0_BYPASS_PWM_TUNE_POS_VREFPFM: 8;
            __IO uint32_t CORE0_BYPASS_PWM_TUNE_POS_VREFOCP: 3;
            __IO uint32_t CORE0_FPWM: 1;
            __IO uint32_t CORE0_POW_PFM: 1;
            __IO uint32_t CORE0_POW_PWM: 1;
            __IO uint32_t CORE0_POW_VDIV: 1;
            __IO uint32_t CORE0_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE0_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE0_XTAL_OV_MODE: 3;
            __IO uint32_t CORE0_EN_POWERMOS_DR8X: 1;
            __IO uint32_t CORE0_SEL_OCP_TABLE: 1;
        } BITS_25C;
    } u_25C;

    /* 0x0260       0x4000_0260
        1:0     R/W    CORE4_TUNE_OCP_RES                      2'h0
        4:2     R/W    CORE4_TUNE_PWM_R3                       3'h0
        7:5     R/W    CORE4_TUNE_PWM_R2                       3'h0
        10:8    R/W    CORE4_TUNE_PWM_R1                       3'h0
        13:11   R/W    CORE4_TUNE_PWM_C3                       3'h0
        16:14   R/W    CORE4_TUNE_PWM_C2                       3'h0
        19:17   R/W    CORE4_TUNE_PWM_C1                       3'h0
        20      R/W    CORE4_BYPASS_PWM_BYPASS_RoughSS         1'h0
        22:21   R/W    CORE4_BYPASS_PWM_TUNE_RoughSS           2'h0
        25:23   R/W    CORE4_BYPASS_PWM_TUNE_VCL               3'h0
        28:26   R/W    CORE4_BYPASS_PWM_TUNE_VCH               3'h0
        29      R/W    CORE4_X4_PWM_COMP_IB                    1'h0
        30      R/W    CORE4_X4_POW_PWM_CLP                    1'h0
        31      R/W    CORE4_X4_TUNE_VDIV_Bit0                 1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR4_31_0;
        struct
        {
            __IO uint32_t CORE4_TUNE_OCP_RES: 2;
            __IO uint32_t CORE4_TUNE_PWM_R3: 3;
            __IO uint32_t CORE4_TUNE_PWM_R2: 3;
            __IO uint32_t CORE4_TUNE_PWM_R1: 3;
            __IO uint32_t CORE4_TUNE_PWM_C3: 3;
            __IO uint32_t CORE4_TUNE_PWM_C2: 3;
            __IO uint32_t CORE4_TUNE_PWM_C1: 3;
            __IO uint32_t CORE4_BYPASS_PWM_BYPASS_RoughSS: 1;
            __IO uint32_t CORE4_BYPASS_PWM_TUNE_RoughSS: 2;
            __IO uint32_t CORE4_BYPASS_PWM_TUNE_VCL: 3;
            __IO uint32_t CORE4_BYPASS_PWM_TUNE_VCH: 3;
            __IO uint32_t CORE4_X4_PWM_COMP_IB: 1;
            __IO uint32_t CORE4_X4_POW_PWM_CLP: 1;
            __IO uint32_t CORE4_X4_TUNE_VDIV_Bit0: 1;
        } BITS_260;
    } u_260;

    /* 0x0264       0x4000_0264
        6:0     R/W    CORE4_X4_TUNE_VDIV_Bit7_Bit1            7'h0
        14:7    R/W    CORE4_BYPASS_PWM_TUNE_POS_VREFPFM       8'h0
        17:15   R/W    CORE4_BYPASS_PWM_TUNE_POS_VREFOCP       3'h0
        18      R/W    CORE4_FPWM                              1'h0
        19      R/W    CORE4_POW_PFM                           1'h0
        20      R/W    CORE4_POW_PWM                           1'h0
        21      R/W    CORE4_POW_VDIV                          1'h0
        23:22   R/W    CORE4_XTAL_OV_RATIO                     2'h0
        26:24   R/W    CORE4_XTAL_OV_UNIT                      3'h0
        29:27   R/W    CORE4_XTAL_OV_MODE                      3'h0
        30      R/W    CORE4_EN_POWERMOS_DR8X                  1'h0
        31      R/W    CORE4_SEL_OCP_TABLE                     1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR4_63_32;
        struct
        {
            __IO uint32_t CORE4_X4_TUNE_VDIV_Bit7_Bit1: 7;
            __IO uint32_t CORE4_BYPASS_PWM_TUNE_POS_VREFPFM: 8;
            __IO uint32_t CORE4_BYPASS_PWM_TUNE_POS_VREFOCP: 3;
            __IO uint32_t CORE4_FPWM: 1;
            __IO uint32_t CORE4_POW_PFM: 1;
            __IO uint32_t CORE4_POW_PWM: 1;
            __IO uint32_t CORE4_POW_VDIV: 1;
            __IO uint32_t CORE4_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE4_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE4_XTAL_OV_MODE: 3;
            __IO uint32_t CORE4_EN_POWERMOS_DR8X: 1;
            __IO uint32_t CORE4_SEL_OCP_TABLE: 1;
        } BITS_264;
    } u_264;

    /* 0x0268       0x4000_0268
        1:0     R/W    CORE5_TUNE_OCP_RES                      2'h0
        4:2     R/W    CORE5_TUNE_PWM_R3                       3'h0
        7:5     R/W    CORE5_TUNE_PWM_R2                       3'h0
        10:8    R/W    CORE5_TUNE_PWM_R1                       3'h0
        13:11   R/W    CORE5_TUNE_PWM_C3                       3'h0
        16:14   R/W    CORE5_TUNE_PWM_C2                       3'h0
        19:17   R/W    CORE5_TUNE_PWM_C1                       3'h0
        20      R/W    CORE5_BYPASS_PWM_BYPASS_RoughSS         1'h0
        22:21   R/W    CORE5_BYPASS_PWM_TUNE_RoughSS           2'h0
        25:23   R/W    CORE5_BYPASS_PWM_TUNE_VCL               3'h0
        28:26   R/W    CORE5_BYPASS_PWM_TUNE_VCH               3'h0
        29      R/W    CORE5_X4_PWM_COMP_IB                    1'h0
        30      R/W    CORE5_X4_POW_PWM_CLP                    1'h0
        31      R/W    CORE5_X4_TUNE_VDIV_Bit0                 1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR5_31_0;
        struct
        {
            __IO uint32_t CORE5_TUNE_OCP_RES: 2;
            __IO uint32_t CORE5_TUNE_PWM_R3: 3;
            __IO uint32_t CORE5_TUNE_PWM_R2: 3;
            __IO uint32_t CORE5_TUNE_PWM_R1: 3;
            __IO uint32_t CORE5_TUNE_PWM_C3: 3;
            __IO uint32_t CORE5_TUNE_PWM_C2: 3;
            __IO uint32_t CORE5_TUNE_PWM_C1: 3;
            __IO uint32_t CORE5_BYPASS_PWM_BYPASS_RoughSS: 1;
            __IO uint32_t CORE5_BYPASS_PWM_TUNE_RoughSS: 2;
            __IO uint32_t CORE5_BYPASS_PWM_TUNE_VCL: 3;
            __IO uint32_t CORE5_BYPASS_PWM_TUNE_VCH: 3;
            __IO uint32_t CORE5_X4_PWM_COMP_IB: 1;
            __IO uint32_t CORE5_X4_POW_PWM_CLP: 1;
            __IO uint32_t CORE5_X4_TUNE_VDIV_Bit0: 1;
        } BITS_268;
    } u_268;

    /* 0x026C       0x4000_026c
        6:0     R/W    CORE5_X4_TUNE_VDIV_Bit7_Bit1            7'h0
        14:7    R/W    CORE5_BYPASS_PWM_TUNE_POS_VREFPFM       8'h0
        17:15   R/W    CORE5_BYPASS_PWM_TUNE_POS_VREFOCP       3'h0
        18      R/W    CORE5_FPWM                              1'h0
        19      R/W    CORE5_POW_PFM                           1'h0
        20      R/W    CORE5_POW_PWM                           1'h0
        21      R/W    CORE5_POW_VDIV                          1'h0
        23:22   R/W    CORE5_XTAL_OV_RATIO                     2'h0
        26:24   R/W    CORE5_XTAL_OV_UNIT                      3'h0
        29:27   R/W    CORE5_XTAL_OV_MODE                      3'h0
        30      R/W    CORE5_EN_POWERMOS_DR8X                  1'h0
        31      R/W    CORE5_SEL_OCP_TABLE                     1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR5_63_32;
        struct
        {
            __IO uint32_t CORE5_X4_TUNE_VDIV_Bit7_Bit1: 7;
            __IO uint32_t CORE5_BYPASS_PWM_TUNE_POS_VREFPFM: 8;
            __IO uint32_t CORE5_BYPASS_PWM_TUNE_POS_VREFOCP: 3;
            __IO uint32_t CORE5_FPWM: 1;
            __IO uint32_t CORE5_POW_PFM: 1;
            __IO uint32_t CORE5_POW_PWM: 1;
            __IO uint32_t CORE5_POW_VDIV: 1;
            __IO uint32_t CORE5_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE5_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE5_XTAL_OV_MODE: 3;
            __IO uint32_t CORE5_EN_POWERMOS_DR8X: 1;
            __IO uint32_t CORE5_SEL_OCP_TABLE: 1;
        } BITS_26C;
    } u_26C;

    /* 0x0270       0x4000_0270
        0       R/W    CORE0_EN_HVD17_LOWIQ                    1'h0
        4:1     R/W    CORE0_TUNE_HVD17_IB                     4'h0
        5       R/W    CORE0_X4_PFM_COMP_IB                    1'h0
        8:6     R/W    CORE0_TUNE_PFM_VREFOCPPFM               3'h0
        14:9    R/W    CORE0_TUNE_SAW_ICLK                     6'h0
        15      R/W    RESERVED491                             1'h0
        16      R/W    CORE4_EN_HVD17_LOWIQ                    1'h0
        20:17   R/W    CORE4_TUNE_HVD17_IB                     4'h0
        21      R/W    CORE4_X4_PFM_COMP_IB                    1'h0
        24:22   R/W    CORE4_TUNE_PFM_VREFOCPPFM               3'h0
        30:25   R/W    CORE4_TUNE_SAW_ICLK                     6'h0
        31      R/W    RESERVED485                             1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR4_79_64_AUTO_SW_PAR0_79_64;
        struct
        {
            __IO uint32_t CORE0_EN_HVD17_LOWIQ: 1;
            __IO uint32_t CORE0_TUNE_HVD17_IB: 4;
            __IO uint32_t CORE0_X4_PFM_COMP_IB: 1;
            __IO uint32_t CORE0_TUNE_PFM_VREFOCPPFM: 3;
            __IO uint32_t CORE0_TUNE_SAW_ICLK: 6;
            __IO uint32_t RESERVED491: 1;
            __IO uint32_t CORE4_EN_HVD17_LOWIQ: 1;
            __IO uint32_t CORE4_TUNE_HVD17_IB: 4;
            __IO uint32_t CORE4_X4_PFM_COMP_IB: 1;
            __IO uint32_t CORE4_TUNE_PFM_VREFOCPPFM: 3;
            __IO uint32_t CORE4_TUNE_SAW_ICLK: 6;
            __IO uint32_t RESERVED485: 1;
        } BITS_270;
    } u_270;

