wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x0274       0x4000_0274
        19:0    R/W    r_dss_data_in                           20'h0
        22:20   R/W    r_dss_ro_sel                            3'h0
        23      R/W    r_dss_wire_sel                          1'h0
        24      R/W    r_dss_clk_en                            1'h0
        25      R/W    r_dss_speed_en                          1'h0
        26      R/W    r_FEN_DSS                               1'h0
        31:27   R/W    RESERVED498                             5'h0
    */
    union
    {
        __IO uint32_t REG_DSS_CTRL;
        struct
        {
            __IO uint32_t r_dss_data_in: 20;
            __IO uint32_t r_dss_ro_sel: 3;
            __IO uint32_t r_dss_wire_sel: 1;
            __IO uint32_t r_dss_clk_en: 1;
            __IO uint32_t r_dss_speed_en: 1;
            __IO uint32_t r_FEN_DSS: 1;
            __IO uint32_t RESERVED498: 5;
        } BITS_274;
    } u_274;

    /* 0x0278       0x4000_0278
        19:0    R      bset_dss_count_out                      20'h0
        20      R      bset_dss_wsort_go                       1'h0
        21      R      bset_dss_ready                          1'h0
        31:22   R      RESERVED506                             10'h0
    */
    union
    {
        __IO uint32_t REG_BEST_DSS_RD;
        struct
        {
            __I uint32_t bset_dss_count_out: 20;
            __I uint32_t bset_dss_wsort_go: 1;
            __I uint32_t bset_dss_ready: 1;
            __I uint32_t RESERVED506: 10;
        } BITS_278;
    } u_278;

    /* 0x027C       0x4000_027c
        19:0    R      dss_ir_count_out                        20'h0
        20      R      dss_ir_wsort_go                         1'h0
        21      R      dss_ir_ready                            1'h0
        31:22   R      RESERVED511                             10'h0
    */
    union
    {
        __IO uint32_t REG_BEST_DSS_IR_RD;
        struct
        {
            __I uint32_t dss_ir_count_out: 20;
            __I uint32_t dss_ir_wsort_go: 1;
            __I uint32_t dss_ir_ready: 1;
            __I uint32_t RESERVED511: 10;
        } BITS_27C;
    } u_27C;

    __IO uint32_t RSVD_0x280[9];

    /* 0x02A4       0x4000_02a4
        31:0    R/W    RESERVED516                             32'h0
    */
    union
    {
        __IO uint32_t REG_GPIOE_dummy;
        struct
        {
            __IO uint32_t RESERVED516: 32;
        } BITS_2A4;
    } u_2A4;

    /* 0x02A8       0x4000_02a8
        3:0     R/W    PMUX_TEST_MODE                          4'h1
        6:4     R/W    RESERVED539                             3'h0
        7       R/W    PMUX_TEST_MODE_EN                       1'h0
        8       R/W    PMUX_DBG_INF_EN                         1'h0
        9       R/W    PMUX_DBG_FLASH_INF_EN                   1'h0
        10      R/W    PMUX_SPI_DMA_REQ_EN                     1'h0
        11      R/W    PMUX_OPI_EN                             1'h0
        12      R/W    PMUX_LCD_EN                             1'h0
        13      R/W    PMUX_LCD_VSYNC_DIS                      1'h0
        14      R/W    PMUX_LCD_RD_DIS                         1'h0
        15      R/W    PMUX_LCD_VSYNC_IO_SEL                   1'h0
        19:16   R/W    PMUX_DBG_MODE_SEL                       4'h2
        20      R/W    PMUX_FLASH_EXTS_FT_EN                   1'h0
        22:21   R/W    RESERVED527                             2'h0
        23      R/W    r_dbg_cpu_dsp_clk_en                    1'h0
        24      R/W    SPIC_MASTER_EN                          1'h0
        25      R/W    SPIC1_MASTER_EN                         1'h0
        26      R/W    SPIC2_MASTER_EN                         1'h0
        27      R/W    PMUX_FLASH_EXTC_MP_EN                   1'h0
        28      R/W    PMUX_DIG_SMUX_EN                        1'h0
        29      R/W    RESERVED520                             1'h0
        30      R/W    RESERVED519                             1'h0
        31      R/W    RESERVED518                             1'h0
    */
    union
    {
        __IO uint32_t REG_TEST_MODE;
        struct
        {
            __IO uint32_t PMUX_TEST_MODE: 4;
            __IO uint32_t RESERVED539: 3;
            __IO uint32_t PMUX_TEST_MODE_EN: 1;
            __IO uint32_t PMUX_DBG_INF_EN: 1;
            __IO uint32_t PMUX_DBG_FLASH_INF_EN: 1;
            __IO uint32_t PMUX_SPI_DMA_REQ_EN: 1;
            __IO uint32_t PMUX_OPI_EN: 1;
            __IO uint32_t PMUX_LCD_EN: 1;
            __IO uint32_t PMUX_LCD_VSYNC_DIS: 1;
            __IO uint32_t PMUX_LCD_RD_DIS: 1;
            __IO uint32_t PMUX_LCD_VSYNC_IO_SEL: 1;
            __IO uint32_t PMUX_DBG_MODE_SEL: 4;
            __IO uint32_t PMUX_FLASH_EXTS_FT_EN: 1;
            __IO uint32_t RESERVED527: 2;
            __IO uint32_t r_dbg_cpu_dsp_clk_en: 1;
            __IO uint32_t SPIC_MASTER_EN: 1;
            __IO uint32_t SPIC1_MASTER_EN: 1;
            __IO uint32_t SPIC2_MASTER_EN: 1;
            __IO uint32_t PMUX_FLASH_EXTC_MP_EN: 1;
            __IO uint32_t PMUX_DIG_SMUX_EN: 1;
            __IO uint32_t RESERVED520: 1;
            __IO uint32_t RESERVED519: 1;
            __IO uint32_t RESERVED518: 1;
        } BITS_2A8;
    } u_2A8;

    /* 0x02AC       0x4000_02ac
        0       R/W    r_PMUX_UART0_1_W_EN                     1'h0
        1       R/W    r_PMUX_UART1_1_W_EN                     1'h0
        2       R/W    r_PMUX_UART2_1_W_EN                     1'h0
        3       R/W    r_PMUX_UART3_1_W_EN                     1'h0
        4       R/W    r_PMUX_UART4_1_W_EN                     1'h0
        5       R/W    r_PMUX_UART5_1_W_EN                     1'h0
        7:6     R/W    RESERVED559                             2'h0
        8       R/W    r_SPIC0_PULL_SEL_SIO0_PULL_CTRL         1'h0
        9       R/W    r_SPIC0_PULL_SEL_SIO1_PULL_CTRL         1'h0
        10      R/W    r_SPIC0_PULL_SEL_SIO2_PULL_CTRL         1'h0
        11      R/W    r_SPIC0_PULL_SEL_SIO3_PULL_CTRL         1'h0
        12      R/W    r_SPIC1_PULL_SEL_SIO0_PULL_CTRL         1'h0
        13      R/W    r_SPIC1_PULL_SEL_SIO1_PULL_CTRL         1'h0
        14      R/W    r_SPIC1_PULL_SEL_SIO2_PULL_CTRL         1'h0
        15      R/W    r_SPIC1_PULL_SEL_SIO3_PULL_CTRL         1'h0
        16      R/W    r_SPIC2_PULL_SEL_SIO0_PULL_CTRL         1'h0
        17      R/W    r_SPIC2_PULL_SEL_SIO1_PULL_CTRL         1'h0
        18      R/W    r_SPIC2_PULL_SEL_SIO2_PULL_CTRL         1'h0
        19      R/W    r_SPIC2_PULL_SEL_SIO3_PULL_CTRL         1'h0
        20      R/W    r_SPIC3_PULL_SEL_SIO0_PULL_CTRL         1'h0
        21      R/W    r_SPIC3_PULL_SEL_SIO1_PULL_CTRL         1'h0
        22      R/W    r_SPIC3_PULL_SEL_SIO2_PULL_CTRL         1'h0
        23      R/W    r_SPIC3_PULL_SEL_SIO3_PULL_CTRL         1'h0
        31:24   R/W    RESERVED542                             8'h0
    */
    union
    {
        __IO uint32_t REG_TEST_MODE;
        struct
        {
            __IO uint32_t r_PMUX_UART0_1_W_EN: 1;
            __IO uint32_t r_PMUX_UART1_1_W_EN: 1;
            __IO uint32_t r_PMUX_UART2_1_W_EN: 1;
            __IO uint32_t r_PMUX_UART3_1_W_EN: 1;
            __IO uint32_t r_PMUX_UART4_1_W_EN: 1;
            __IO uint32_t r_PMUX_UART5_1_W_EN: 1;
            __IO uint32_t RESERVED559: 2;
            __IO uint32_t r_SPIC0_PULL_SEL_SIO0_PULL_CTRL: 1;
            __IO uint32_t r_SPIC0_PULL_SEL_SIO1_PULL_CTRL: 1;
            __IO uint32_t r_SPIC0_PULL_SEL_SIO2_PULL_CTRL: 1;
            __IO uint32_t r_SPIC0_PULL_SEL_SIO3_PULL_CTRL: 1;
            __IO uint32_t r_SPIC1_PULL_SEL_SIO0_PULL_CTRL: 1;
            __IO uint32_t r_SPIC1_PULL_SEL_SIO1_PULL_CTRL: 1;
            __IO uint32_t r_SPIC1_PULL_SEL_SIO2_PULL_CTRL: 1;
            __IO uint32_t r_SPIC1_PULL_SEL_SIO3_PULL_CTRL: 1;
            __IO uint32_t r_SPIC2_PULL_SEL_SIO0_PULL_CTRL: 1;
            __IO uint32_t r_SPIC2_PULL_SEL_SIO1_PULL_CTRL: 1;
            __IO uint32_t r_SPIC2_PULL_SEL_SIO2_PULL_CTRL: 1;
            __IO uint32_t r_SPIC2_PULL_SEL_SIO3_PULL_CTRL: 1;
            __IO uint32_t r_SPIC3_PULL_SEL_SIO0_PULL_CTRL: 1;
            __IO uint32_t r_SPIC3_PULL_SEL_SIO1_PULL_CTRL: 1;
            __IO uint32_t r_SPIC3_PULL_SEL_SIO2_PULL_CTRL: 1;
            __IO uint32_t r_SPIC3_PULL_SEL_SIO3_PULL_CTRL: 1;
            __IO uint32_t RESERVED542: 8;
        } BITS_2AC;
    } u_2AC;

    /* 0x02B0       0x4000_02b0
        0       R      SPI_FLASH_SEL                           1'h0
        31:1    R/W    RESERVED567                             31'h0
    */
    union
    {
        __IO uint32_t REG_0x2B0;
        struct
        {
            __I uint32_t SPI_FLASH_SEL: 1;
            __IO uint32_t RESERVED567: 31;
        } BITS_2B0;
    } u_2B0;

    /* 0x02B4       0x4000_02b4
        0       R/W    PMUX_SDIO_EN                            1'h0
        1       R/W    PMUX_SDIO_SEL                           1'h0
        3:2     R/W    RESERVED572                             2'h0
        11:4    R/W    PMUX_SDIO_PIN_EN                        8'h0
        31:12   R/W    RESERVED570                             20'h0
    */
    union
    {
        __IO uint32_t REG_0x2B4;
        struct
        {
            __IO uint32_t PMUX_SDIO_EN: 1;
            __IO uint32_t PMUX_SDIO_SEL: 1;
            __IO uint32_t RESERVED572: 2;
            __IO uint32_t PMUX_SDIO_PIN_EN: 8;
            __IO uint32_t RESERVED570: 20;
        } BITS_2B4;
    } u_2B4;

    /* 0x02B8       0x4000_02b8
        0       R/W    SPIC1_QPI_EN                            1'h0
        1       R/W    SPIC0_DDR_MODE_EN                       1'h0
        2       R/W    SPIC1_DDR_MODE_EN                       1'h0
        3       R/W    SPIC2_DDR_MODE_EN                       1'h0
        4       R/W    SPIC0_SCLK_SHIFT_EN                     1'h0
        5       R/W    SPIC1_SCLK_SHIFT_EN                     1'h0
        6       R/W    SPIC2_SCLK_SHIFT_EN                     1'h0
        7       R/W    SPIC3_QPI_EN                            1'h0
        8       R/W    SPIC3_DDR_MODE_EN                       1'h0
        9       R/W    SPIC3_SCLK_SHIFT_EN                     1'h0
        10      R/W    SPIC_INT_SYNC_CLK_EN                    1'h0
        31:11   R/W    RESERVED576                             21'h0
    */
    union
    {
        __IO uint32_t REG_SPI_OPI_PHY_Ctrl;
        struct
        {
            __IO uint32_t SPIC1_QPI_EN: 1;
            __IO uint32_t SPIC0_DDR_MODE_EN: 1;
            __IO uint32_t SPIC1_DDR_MODE_EN: 1;
            __IO uint32_t SPIC2_DDR_MODE_EN: 1;
            __IO uint32_t SPIC0_SCLK_SHIFT_EN: 1;
            __IO uint32_t SPIC1_SCLK_SHIFT_EN: 1;
            __IO uint32_t SPIC2_SCLK_SHIFT_EN: 1;
            __IO uint32_t SPIC3_QPI_EN: 1;
            __IO uint32_t SPIC3_DDR_MODE_EN: 1;
            __IO uint32_t SPIC3_SCLK_SHIFT_EN: 1;
            __IO uint32_t SPIC_INT_SYNC_CLK_EN: 1;
            __IO uint32_t RESERVED576: 21;
        } BITS_2B8;
    } u_2B8;

