wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x02BC       0x4000_02bc
        31:0    R/W    RESERVED589                             32'h0
    */
    union
    {
        __IO uint32_t REG_0x02BC;
        struct
        {
            __IO uint32_t RESERVED589: 32;
        } BITS_2BC;
    } u_2BC;

    /* 0x02C0       0x4000_02c0
        1:0     R/W    CORE6_TUNE_OCP_RES                      2'h0
        4:2     R/W    CORE6_TUNE_PWM_R3                       3'h0
        7:5     R/W    CORE6_TUNE_PWM_R2                       3'h0
        10:8    R/W    CORE6_TUNE_PWM_R1                       3'h0
        13:11   R/W    CORE6_TUNE_PWM_C3                       3'h0
        16:14   R/W    CORE6_TUNE_PWM_C2                       3'h0
        19:17   R/W    CORE6_TUNE_PWM_C1                       3'h0
        20      R/W    CORE6_BYPASS_PWM_BYPASS_RoughSS         1'h0
        22:21   R/W    CORE6_BYPASS_PWM_TUNE_RoughSS           2'h0
        25:23   R/W    CORE6_BYPASS_PWM_TUNE_VCL               3'h0
        28:26   R/W    CORE6_BYPASS_PWM_TUNE_VCH               3'h0
        29      R/W    CORE6_X4_PWM_COMP_IB                    1'h0
        30      R/W    CORE6_X4_POW_PWM_CLP                    1'h0
        31      R/W    CORE6_X4_TUNE_VDIV_Bit0                 1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR6_31_0;
        struct
        {
            __IO uint32_t CORE6_TUNE_OCP_RES: 2;
            __IO uint32_t CORE6_TUNE_PWM_R3: 3;
            __IO uint32_t CORE6_TUNE_PWM_R2: 3;
            __IO uint32_t CORE6_TUNE_PWM_R1: 3;
            __IO uint32_t CORE6_TUNE_PWM_C3: 3;
            __IO uint32_t CORE6_TUNE_PWM_C2: 3;
            __IO uint32_t CORE6_TUNE_PWM_C1: 3;
            __IO uint32_t CORE6_BYPASS_PWM_BYPASS_RoughSS: 1;
            __IO uint32_t CORE6_BYPASS_PWM_TUNE_RoughSS: 2;
            __IO uint32_t CORE6_BYPASS_PWM_TUNE_VCL: 3;
            __IO uint32_t CORE6_BYPASS_PWM_TUNE_VCH: 3;
            __IO uint32_t CORE6_X4_PWM_COMP_IB: 1;
            __IO uint32_t CORE6_X4_POW_PWM_CLP: 1;
            __IO uint32_t CORE6_X4_TUNE_VDIV_Bit0: 1;
        } BITS_2C0;
    } u_2C0;

    /* 0x02C4       0x4000_02c4
        6:0     R/W    CORE6_X4_TUNE_VDIV_Bit7_Bit1            7'h0
        14:7    R/W    CORE6_BYPASS_PWM_TUNE_POS_VREFPFM       8'h0
        17:15   R/W    CORE6_BYPASS_PWM_TUNE_POS_VREFOCP       3'h0
        18      R/W    CORE6_FPWM                              1'h0
        19      R/W    CORE6_POW_PFM                           1'h0
        20      R/W    CORE6_POW_PWM                           1'h0
        21      R/W    CORE6_POW_VDIV                          1'h0
        23:22   R/W    CORE6_XTAL_OV_RATIO                     2'h0
        26:24   R/W    CORE6_XTAL_OV_UNIT                      3'h0
        29:27   R/W    CORE6_XTAL_OV_MODE                      3'h0
        30      R/W    CORE6_EN_POWERMOS_DR8X                  1'h0
        31      R/W    CORE6_SEL_OCP_TABLE                     1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR6_63_32;
        struct
        {
            __IO uint32_t CORE6_X4_TUNE_VDIV_Bit7_Bit1: 7;
            __IO uint32_t CORE6_BYPASS_PWM_TUNE_POS_VREFPFM: 8;
            __IO uint32_t CORE6_BYPASS_PWM_TUNE_POS_VREFOCP: 3;
            __IO uint32_t CORE6_FPWM: 1;
            __IO uint32_t CORE6_POW_PFM: 1;
            __IO uint32_t CORE6_POW_PWM: 1;
            __IO uint32_t CORE6_POW_VDIV: 1;
            __IO uint32_t CORE6_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE6_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE6_XTAL_OV_MODE: 3;
            __IO uint32_t CORE6_EN_POWERMOS_DR8X: 1;
            __IO uint32_t CORE6_SEL_OCP_TABLE: 1;
        } BITS_2C4;
    } u_2C4;

    /* 0x02C8       0x4000_02c8
        1:0     R/W    CORE7_TUNE_OCP_RES                      2'h0
        4:2     R/W    CORE7_TUNE_PWM_R3                       3'h0
        7:5     R/W    CORE7_TUNE_PWM_R2                       3'h0
        10:8    R/W    CORE7_TUNE_PWM_R1                       3'h0
        13:11   R/W    CORE7_TUNE_PWM_C3                       3'h0
        16:14   R/W    CORE7_TUNE_PWM_C2                       3'h0
        19:17   R/W    CORE7_TUNE_PWM_C1                       3'h0
        20      R/W    CORE7_BYPASS_PWM_BYPASS_RoughSS         1'h0
        22:21   R/W    CORE7_BYPASS_PWM_TUNE_RoughSS           2'h0
        25:23   R/W    CORE7_BYPASS_PWM_TUNE_VCL               3'h0
        28:26   R/W    CORE7_BYPASS_PWM_TUNE_VCH               3'h0
        29      R/W    CORE7_X4_PWM_COMP_IB                    1'h0
        30      R/W    CORE7_X4_POW_PWM_CLP                    1'h0
        31      R/W    CORE7_X4_TUNE_VDIV_Bit0                 1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR7_31_0;
        struct
        {
            __IO uint32_t CORE7_TUNE_OCP_RES: 2;
            __IO uint32_t CORE7_TUNE_PWM_R3: 3;
            __IO uint32_t CORE7_TUNE_PWM_R2: 3;
            __IO uint32_t CORE7_TUNE_PWM_R1: 3;
            __IO uint32_t CORE7_TUNE_PWM_C3: 3;
            __IO uint32_t CORE7_TUNE_PWM_C2: 3;
            __IO uint32_t CORE7_TUNE_PWM_C1: 3;
            __IO uint32_t CORE7_BYPASS_PWM_BYPASS_RoughSS: 1;
            __IO uint32_t CORE7_BYPASS_PWM_TUNE_RoughSS: 2;
            __IO uint32_t CORE7_BYPASS_PWM_TUNE_VCL: 3;
            __IO uint32_t CORE7_BYPASS_PWM_TUNE_VCH: 3;
            __IO uint32_t CORE7_X4_PWM_COMP_IB: 1;
            __IO uint32_t CORE7_X4_POW_PWM_CLP: 1;
            __IO uint32_t CORE7_X4_TUNE_VDIV_Bit0: 1;
        } BITS_2C8;
    } u_2C8;

    /* 0x02CC       0x4000_02cc
        6:0     R/W    CORE7_X4_TUNE_VDIV_Bit7_Bit1            7'h0
        14:7    R/W    CORE7_BYPASS_PWM_TUNE_POS_VREFPFM       8'h0
        17:15   R/W    CORE7_BYPASS_PWM_TUNE_POS_VREFOCP       3'h0
        18      R/W    CORE7_FPWM                              1'h0
        19      R/W    CORE7_POW_PFM                           1'h0
        20      R/W    CORE7_POW_PWM                           1'h0
        21      R/W    CORE7_POW_VDIV                          1'h0
        23:22   R/W    CORE7_XTAL_OV_RATIO                     2'h0
        26:24   R/W    CORE7_XTAL_OV_UNIT                      3'h0
        29:27   R/W    CORE7_XTAL_OV_MODE                      3'h0
        30      R/W    CORE7_EN_POWERMOS_DR8X                  1'h0
        31      R/W    CORE7_SEL_OCP_TABLE                     1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR7_63_32;
        struct
        {
            __IO uint32_t CORE7_X4_TUNE_VDIV_Bit7_Bit1: 7;
            __IO uint32_t CORE7_BYPASS_PWM_TUNE_POS_VREFPFM: 8;
            __IO uint32_t CORE7_BYPASS_PWM_TUNE_POS_VREFOCP: 3;
            __IO uint32_t CORE7_FPWM: 1;
            __IO uint32_t CORE7_POW_PFM: 1;
            __IO uint32_t CORE7_POW_PWM: 1;
            __IO uint32_t CORE7_POW_VDIV: 1;
            __IO uint32_t CORE7_XTAL_OV_RATIO: 2;
            __IO uint32_t CORE7_XTAL_OV_UNIT: 3;
            __IO uint32_t CORE7_XTAL_OV_MODE: 3;
            __IO uint32_t CORE7_EN_POWERMOS_DR8X: 1;
            __IO uint32_t CORE7_SEL_OCP_TABLE: 1;
        } BITS_2CC;
    } u_2CC;

    /* 0x02D0       0x4000_02d0
        3:0     R/W    flash1_div_sel                          4'h0
        4       R/W    flash1_div_en                           1'h0
        5       R/W    FLASH1_CLK_SRC_EN                       1'h0
        6       R/W    flash1_clk_src_sel_1                    1'h0
        7       R/W    flash1_clk_src_sel_0                    1'h0
        8       R/W    flash1_mux_1_clk_cg_en                  1'h0
        12:9    R/W    flash2_div_sel                          4'h0
        13      R/W    flash2_div_en                           1'h0
        14      R/W    FLASH2_CLK_SRC_EN                       1'h0
        15      R/W    flash2_clk_src_sel_1                    1'h0
        16      R/W    flash2_clk_src_sel_0                    1'h0
        17      R/W    flash2_mux_1_clk_cg_en                  1'h0
        18      R/W    r_flash_clk_inv_en                      1'b0
        19      R/W    r_flash1_clk_inv_en                     1'b0
        20      R/W    r_flash2_clk_inv_en                     1'b0
        21      R/W    r_flash3_clk_inv_en                     1'b0
        26:22   R/W    RESERVED652                             5'h0
        27      R/W    R_FLASH1_CLK_SRC_PLL_SEL_0              1'h0
        28      R/W    R_FLASH2_CLK_SRC_PLL_SEL_0              1'h0
        29      R/W    R_FLASH1_CLK_SRC_PLL_SEL_1              1'h0
        30      R/W    R_FLASH2_CLK_SRC_PLL_SEL_1              1'h0
        31      R/W    RESERVED647                             1'h0
    */
    union
    {
        __IO uint32_t REG_0x2D0;
        struct
        {
            __IO uint32_t flash1_div_sel: 4;
            __IO uint32_t flash1_div_en: 1;
            __IO uint32_t FLASH1_CLK_SRC_EN: 1;
            __IO uint32_t flash1_clk_src_sel_1: 1;
            __IO uint32_t flash1_clk_src_sel_0: 1;
            __IO uint32_t flash1_mux_1_clk_cg_en: 1;
            __IO uint32_t flash2_div_sel: 4;
            __IO uint32_t flash2_div_en: 1;
            __IO uint32_t FLASH2_CLK_SRC_EN: 1;
            __IO uint32_t flash2_clk_src_sel_1: 1;
            __IO uint32_t flash2_clk_src_sel_0: 1;
            __IO uint32_t flash2_mux_1_clk_cg_en: 1;
            __IO uint32_t r_flash_clk_inv_en: 1;
            __IO uint32_t r_flash1_clk_inv_en: 1;
            __IO uint32_t r_flash2_clk_inv_en: 1;
            __IO uint32_t r_flash3_clk_inv_en: 1;
            __IO uint32_t RESERVED652: 5;
            __IO uint32_t R_FLASH1_CLK_SRC_PLL_SEL_0: 1;
            __IO uint32_t R_FLASH2_CLK_SRC_PLL_SEL_0: 1;
            __IO uint32_t R_FLASH1_CLK_SRC_PLL_SEL_1: 1;
            __IO uint32_t R_FLASH2_CLK_SRC_PLL_SEL_1: 1;
            __IO uint32_t RESERVED647: 1;
        } BITS_2D0;
    } u_2D0;

    /* 0x02D4       0x4000_02d4
        0       R/W    RESERVED690                             1'h0
        1       R/W    USB_CLK_SRC_EN                          1'h0
        2       R/W    USB_CLK_SEL                             1'h0
        3       R/W    USB_CLK_EN                              1'h0
        6:4     R/W    USB_DIV_SEL1                            3'h0
        8:7     R/W    RESERVED685                             2'h0
        12:9    R/W    FLASH3_DIV_SEL                          4'h0
        13      R/W    FLASH3_DIV_EN                           1'h0
        14      R/W    FLASH3_CLK_SRC_EN                       1'h0
        15      R/W    FLASH3_CLK_SRC_SEL_1                    1'h0
        16      R/W    FLASH3_CLK_SRC_SEL_0                    1'h0
        17      R/W    FLASH3_MUX_1_CLK_CG_EN                  1'h0
        18      R/W    R_FLASH3_CLK_SRC_PLL_SEL_0              1'h0
        19      R/W    R_FLASH3_CLK_SRC_PLL_SEL_1              1'h0
        20      R/W    RESERVED676                             1'h0
        23:21   R/W    SDIO1_CLK_DIV                           3'h0
        24      R/W    SDIO1_CLK_DIV_EN                        1'h0
        25      R/W    SDIO1_CLK_SRC_EN                        1'h0
        26      R/W    SDIO1_CLK_SEL0                          1'h0
        27      R/W    SDIO1_CLK_SEL1                          1'h0
        31:28   R/W    RESERVED670                             4'h0
    */
    union
    {
        __IO uint32_t REG_0x2D4;
        struct
        {
            __IO uint32_t RESERVED690: 1;
            __IO uint32_t USB_CLK_SRC_EN: 1;
            __IO uint32_t USB_CLK_SEL: 1;
            __IO uint32_t USB_CLK_EN: 1;
            __IO uint32_t USB_DIV_SEL1: 3;
            __IO uint32_t RESERVED685: 2;
            __IO uint32_t FLASH3_DIV_SEL: 4;
            __IO uint32_t FLASH3_DIV_EN: 1;
            __IO uint32_t FLASH3_CLK_SRC_EN: 1;
            __IO uint32_t FLASH3_CLK_SRC_SEL_1: 1;
            __IO uint32_t FLASH3_CLK_SRC_SEL_0: 1;
            __IO uint32_t FLASH3_MUX_1_CLK_CG_EN: 1;
            __IO uint32_t R_FLASH3_CLK_SRC_PLL_SEL_0: 1;
            __IO uint32_t R_FLASH3_CLK_SRC_PLL_SEL_1: 1;
            __IO uint32_t RESERVED676: 1;
            __IO uint32_t SDIO1_CLK_DIV: 3;
            __IO uint32_t SDIO1_CLK_DIV_EN: 1;
            __IO uint32_t SDIO1_CLK_SRC_EN: 1;
            __IO uint32_t SDIO1_CLK_SEL0: 1;
            __IO uint32_t SDIO1_CLK_SEL1: 1;
            __IO uint32_t RESERVED670: 4;
        } BITS_2D4;
    } u_2D4;

    /* 0x02D8       0x4000_02d8
        31:0    R      RESERVED692                             32'hEAEAEAEA
    */
    union
    {
        __IO uint32_t REG_0x02D8;
        struct
        {
            __I uint32_t RESERVED692: 32;
        } BITS_2D8;
    } u_2D8;

    /* 0x02DC       0x4000_02dc
        0       R/W    CORE5_EN_HVD17_LOWIQ                    1'h0
        4:1     R/W    CORE5_TUNE_HVD17_IB                     4'h0
        5       R/W    CORE5_X4_PFM_COMP_IB                    1'h0
        8:6     R/W    CORE5_TUNE_PFM_VREFOCPPFM               3'h0
        14:9    R/W    CORE5_TUNE_SAW_ICLK                     6'h0
        15      R/W    RESERVED700                             1'h0
        16      R/W    CORE6_EN_HVD17_LOWIQ                    1'h0
        20:17   R/W    CORE6_TUNE_HVD17_IB                     4'h0
        21      R/W    CORE6_X4_PFM_COMP_IB                    1'h0
        24:22   R/W    CORE6_TUNE_PFM_VREFOCPPFM               3'h0
        30:25   R/W    CORE6_TUNE_SAW_ICLK                     6'h0
        31      R/W    RESERVED694                             1'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR6_79_64_AUTO_SW_PAR5_79_64;
        struct
        {
            __IO uint32_t CORE5_EN_HVD17_LOWIQ: 1;
            __IO uint32_t CORE5_TUNE_HVD17_IB: 4;
            __IO uint32_t CORE5_X4_PFM_COMP_IB: 1;
            __IO uint32_t CORE5_TUNE_PFM_VREFOCPPFM: 3;
            __IO uint32_t CORE5_TUNE_SAW_ICLK: 6;
            __IO uint32_t RESERVED700: 1;
            __IO uint32_t CORE6_EN_HVD17_LOWIQ: 1;
            __IO uint32_t CORE6_TUNE_HVD17_IB: 4;
            __IO uint32_t CORE6_X4_PFM_COMP_IB: 1;
            __IO uint32_t CORE6_TUNE_PFM_VREFOCPPFM: 3;
            __IO uint32_t CORE6_TUNE_SAW_ICLK: 6;
            __IO uint32_t RESERVED694: 1;
        } BITS_2DC;
    } u_2DC;

    /* 0x02E0       0x4000_02e0
        0       R/W    DET_ENABLE                              1'h0
        1       R/W    VBUS_DET                                1'h0
        2       R/W    SKIP_SEC_DET                            1'h0
        3       R/W    BC12_CTRL1_DUMMY4                       1'h0
        7:4     R/W    BC12_CTRL1_DUMMY3                       4'h0
        8       R      SDP_OP5A                                1'h0
        9       R      DCP_CDP_1P5A                            1'h0
        10      R      CDP_DET                                 1'h0
        11      R      DCP_DET                                 1'h0
        12      R      OTHERS_OP5A                             1'h0
        13      R      BC12_CTRL1_RSVD5                        1'h0
        14      R      BC12_CTRL1_RSVD4                        1'h0
        15      R      BC12_CTRL1_RSVD3                        1'h0
        16      R      DET_IS_DONE                             1'h0
        17      R      BC12_CTRL1_RSVD2                        1'h0
        18      R      BC12_CTRL1_RSVD1                        1'h0
        28:19   R/W    BC12_CTRL1_DUMMY2                       10'h0
        29      R/W    DCP_OPTION                              1'h1
        30      R/W    BYPASS_NON_STD_DET                      1'h1
        31      R/W    BYPASS_DCD_DBNC                         1'h0
    */
    union
    {
        __IO uint32_t REG_0x02E0;
        struct
        {
            __IO uint32_t DET_ENABLE: 1;
            __IO uint32_t VBUS_DET: 1;
            __IO uint32_t SKIP_SEC_DET: 1;
            __IO uint32_t BC12_CTRL1_DUMMY4: 1;
            __IO uint32_t BC12_CTRL1_DUMMY3: 4;
            __I uint32_t SDP_OP5A: 1;
            __I uint32_t DCP_CDP_1P5A: 1;
            __I uint32_t CDP_DET: 1;
            __I uint32_t DCP_DET: 1;
            __I uint32_t OTHERS_OP5A: 1;
            __I uint32_t BC12_CTRL1_RSVD5: 1;
            __I uint32_t BC12_CTRL1_RSVD4: 1;
            __I uint32_t BC12_CTRL1_RSVD3: 1;
            __I uint32_t DET_IS_DONE: 1;
            __I uint32_t BC12_CTRL1_RSVD2: 1;
            __I uint32_t BC12_CTRL1_RSVD1: 1;
            __IO uint32_t BC12_CTRL1_DUMMY2: 10;
            __IO uint32_t DCP_OPTION: 1;
            __IO uint32_t BYPASS_NON_STD_DET: 1;
            __IO uint32_t BYPASS_DCD_DBNC: 1;
        } BITS_2E0;
    } u_2E0;

    /* 0x02E4       0x4000_02e4
        0       R/W    IDP_SRC_EN_L                            1'h0
        1       R/W    RDM_DOWN_L                              1'h0
        2       R/W    VDP_SRC_EN_L                            1'h0
        3       R/W    IDM_SINK_EN_L                           1'h0
        4       R/W    VDM_SRC_EN_L                            1'h0
        5       R/W    IDP_SINK_EN_L                           1'h0
        6       R/W    NON_STD_DET_EN_L                        1'h0
        7       R/W    BC12_CTRL2_DUMMY3                       1'h0
        8       R/W    FW_CTRL_MODE                            1'h0
        15:9    R/W    BC12_CTRL2_DUMMY2                       7'h0
        19:16   R      VDP_COMP_L                              4'h0
        20      R      VDP_LT_VLOW_L                           1'h0
        24:21   R      VDM_COMP_L                              4'h0
        25      R      VDM_LT_VLOW_L                           1'h0
        31:26   R/W    BC12_CTRL2_DUMMY1                       6'h0
    */
    union
    {
        __IO uint32_t REG_0x02E4;
        struct
        {
            __IO uint32_t IDP_SRC_EN_L: 1;
            __IO uint32_t RDM_DOWN_L: 1;
            __IO uint32_t VDP_SRC_EN_L: 1;
            __IO uint32_t IDM_SINK_EN_L: 1;
            __IO uint32_t VDM_SRC_EN_L: 1;
            __IO uint32_t IDP_SINK_EN_L: 1;
            __IO uint32_t NON_STD_DET_EN_L: 1;
            __IO uint32_t BC12_CTRL2_DUMMY3: 1;
            __IO uint32_t FW_CTRL_MODE: 1;
            __IO uint32_t BC12_CTRL2_DUMMY2: 7;
            __I uint32_t VDP_COMP_L: 4;
            __I uint32_t VDP_LT_VLOW_L: 1;
            __I uint32_t VDM_COMP_L: 4;
            __I uint32_t VDM_LT_VLOW_L: 1;
            __IO uint32_t BC12_CTRL2_DUMMY1: 6;
        } BITS_2E4;
    } u_2E4;

    /* 0x02E8       0x4000_02e8
        15:0    R/W    DCD_A_MIN_TIME                          16'h200
        31:16   R/W    DCD_B_MIN_TIME                          16'h3e80
    */
    union
    {
        __IO uint32_t REG_0x02E8;
        struct
        {
            __IO uint32_t DCD_A_MIN_TIME: 16;
            __IO uint32_t DCD_B_MIN_TIME: 16;
        } BITS_2E8;
    } u_2E8;

