wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x02EC       0x4000_02ec
        15:0    R/W    PRI_DET_MIN_TIME                        16'h500
        31:16   R/W    NOTE_DET_MIN_TIME                       16'h140
    */
    union
    {
        __IO uint32_t REG_0x02EC;
        struct
        {
            __IO uint32_t PRI_DET_MIN_TIME: 16;
            __IO uint32_t NOTE_DET_MIN_TIME: 16;
        } BITS_2EC;
    } u_2EC;

    /* 0x02F0       0x4000_02f0
        15:0    R/W    WAIT_A_MIN_TIME                         16'h280
        31:16   R/W    SECOND_DET_MIN_TIME                     16'h540
    */
    union
    {
        __IO uint32_t REG_0x02F0;
        struct
        {
            __IO uint32_t WAIT_A_MIN_TIME: 16;
            __IO uint32_t SECOND_DET_MIN_TIME: 16;
        } BITS_2F0;
    } u_2F0;

    /* 0x02F4       0x4000_02f4
        15:0    R/W    SA_DET_MIN_TIME                         16'h140
        31:16   R/W    BC12_CTRL6_DUMMY1                       16'h0
    */
    union
    {
        __IO uint32_t REG_0x02F4;
        struct
        {
            __IO uint32_t SA_DET_MIN_TIME: 16;
            __IO uint32_t BC12_CTRL6_DUMMY1: 16;
        } BITS_2F4;
    } u_2F4;

    /* 0x02F8       0x4000_02f8
        31:0    R/W    RESERVED756                             32'h0
    */
    union
    {
        __IO uint32_t REG_0x02F8;
        struct
        {
            __IO uint32_t RESERVED756: 32;
        } BITS_2F8;
    } u_2F8;

    /* 0x02FC       0x4000_02fc
        31:0    R/W    RESERVED758                             32'h0
    */
    union
    {
        __IO uint32_t REG_0x02FC;
        struct
        {
            __IO uint32_t RESERVED758: 32;
        } BITS_2FC;
    } u_2FC;

    /* 0x0300       0x4000_0300
        7:0     R/W    PON_PERI_DLYSEL_SPIM                    8'h0
        15:8    R/W    PON_PERI_DLYSEL_SPIM1                   8'h0
        23:16   R/W    PON_PERI_DLYSEL_SPIM2                   8'h0
        31:24   R/W    PON_PERI_DLYSEL_SPIM3                   8'h0
    */
    union
    {
        __IO uint32_t PON_PERI_DLYSEL_CTRL;
        struct
        {
            __IO uint32_t PON_PERI_DLYSEL_SPIM: 8;
            __IO uint32_t PON_PERI_DLYSEL_SPIM1: 8;
            __IO uint32_t PON_PERI_DLYSEL_SPIM2: 8;
            __IO uint32_t PON_PERI_DLYSEL_SPIM3: 8;
        } BITS_300;
    } u_300;

    /* 0x0304       0x4000_0304
        31:0    R      RESERVED765                             32'h0
    */
    union
    {
        __IO uint32_t REG_0x0304;
        struct
        {
            __I uint32_t RESERVED765: 32;
        } BITS_304;
    } u_304;

    /* 0x0308       0x4000_0308
        0       R/W    PON_SPI0_MST                            1'h0
        1       R/W    PON_SPI0_BRIDGE_EN                      1'h0
        2       R/W    PON_SPI1_BRIDGE_EN                      1'h0
        3       R/W    PON_SPI2_BRIDGE_EN                      1'h0
        4       R/W    PON_SPI1_H2S_BRG_EN                     1'h0
        5       R/W    PON_SPI_SLV_BRIDGE_EN                   1'h0
        6       R/W    JDI_CTRL_MODE_EN                        1'h0
        31:7    R/W    RESERVED767                             25'h0
    */
    union
    {
        __IO uint32_t REG_0x308;
        struct
        {
            __IO uint32_t PON_SPI0_MST: 1;
            __IO uint32_t PON_SPI0_BRIDGE_EN: 1;
            __IO uint32_t PON_SPI1_BRIDGE_EN: 1;
            __IO uint32_t PON_SPI2_BRIDGE_EN: 1;
            __IO uint32_t PON_SPI1_H2S_BRG_EN: 1;
            __IO uint32_t PON_SPI_SLV_BRIDGE_EN: 1;
            __IO uint32_t JDI_CTRL_MODE_EN: 1;
            __IO uint32_t RESERVED767: 25;
        } BITS_308;
    } u_308;

    /* 0x030C       0x4000_030c
        31:0    R      RESERVED776                             32'hEAEAEAEA
    */
    union
    {
        __IO uint32_t REG_0x030C;
        struct
        {
            __I uint32_t RESERVED776: 32;
        } BITS_30C;
    } u_30C;

    /* 0x0310       0x4000_0310
        31:0    R      RESERVED778                             32'hEAEAEAEA
    */
    union
    {
        __IO uint32_t REG_0x0310;
        struct
        {
            __I uint32_t RESERVED778: 32;
        } BITS_310;
    } u_310;

    /* 0x0314       0x4000_0314
        31:0    R      RESERVED780                             32'hEAEAEAEA
    */
    union
    {
        __IO uint32_t REG_0x0314;
        struct
        {
            __I uint32_t RESERVED780: 32;
        } BITS_314;
    } u_314;

    /* 0x0318       0x4000_0318
        31:0    R      RESERVED782                             32'h0
    */
    union
    {
        __IO uint32_t CPU_INTER_ENABLE;
        struct
        {
            __I uint32_t RESERVED782: 32;
        } BITS_318;
    } u_318;

    /* 0x031C       0x4000_031c
        31:0    R      RESERVED784                             32'hEAEAEAEA
    */
    union
    {
        __IO uint32_t REG_0x031C;
        struct
        {
            __I uint32_t RESERVED784: 32;
        } BITS_31C;
    } u_31C;

    /* 0x0320       0x4000_0320
        31:0    R/W    RESERVED786                             32'he0342a43
    */
    union
    {
        __IO uint32_t REG_0x0320;
        struct
        {
            __IO uint32_t RESERVED786: 32;
        } BITS_320;
    } u_320;

    /* 0x0324       0x4000_0324
        31:0    R/W    RESERVED788                             32'h2419e6ab
    */
    union
    {
        __IO uint32_t REG_0x0324;
        struct
        {
            __IO uint32_t RESERVED788: 32;
        } BITS_324;
    } u_324;

    /* 0x0328       0x4000_0328
        31:0    R/W    RESERVED790                             32'he0000000
    */
    union
    {
        __IO uint32_t REG_0x0328;
        struct
        {
            __IO uint32_t RESERVED790: 32;
        } BITS_328;
    } u_328;

    /* 0x032C       0x4000_032c
        3:0     R/W    OSC40_FSET                              4'h8
        31:4    R/W    RESERVED792                             28'h0001090
    */
    union
    {
        __IO uint32_t REG_OSC40_FSET;
        struct
        {
            __IO uint32_t OSC40_FSET: 4;
            __IO uint32_t RESERVED792: 28;
        } BITS_32C;
    } u_32C;

    /* 0x0330       0x4000_0330
        0       RW     rst_n_aac                               1'b0
        1       RW     offset_plus                             1'b0
        7:2     RW     XAAC_GM_offset                          6'h0
        8       RW     GM_STEP                                 1'b0
        14:9    RW     GM_INIT                                 6'h3F
        17:15   RW     XTAL_CLK_SET                            3'b101
        23:18   RW     GM_STUP                                 6'h3F
        29:24   RW     GM_MANUAL                               6'h1F
        30      RW     r_EN_XTAL_AAC_DIGI                      1'b0
        31      RW     r_EN_XTAL_AAC_TRIG                      1'b0
    */
    union
    {
        __IO uint32_t REG_0x330;
        struct
        {
            __IO uint32_t rst_n_aac: 1;
            __IO uint32_t offset_plus: 1;
            __IO uint32_t XAAC_GM_offset: 6;
            __IO uint32_t GM_STEP: 1;
            __IO uint32_t GM_INIT: 6;
            __IO uint32_t XTAL_CLK_SET: 3;
            __IO uint32_t GM_STUP: 6;
            __IO uint32_t GM_MANUAL: 6;
            __IO uint32_t r_EN_XTAL_AAC_DIGI: 1;
            __IO uint32_t r_EN_XTAL_AAC_TRIG: 1;
        } BITS_330;
    } u_330;

