wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x0334       0x4000_0334
        0       R      XAAC_BUSY                               1'b0
        1       R      XAAC_READY                              1'b0
        7:2     R      XTAL_GM_OUT                             6'h1F
        11:8    R      xaac_curr_state                         4'h0
        12      R/W    EN_XTAL_AAC_GM                          1'b0
        13      R/W    EN_XTAL_AAC_PKDET                       1'b0
        14      R      XTAL_PKDET_OUT                          1'b0
        15      R/W    RESERVED807                             1'b0
        31:16   R/W    RESERVED806                             16'h0129
    */
    union
    {
        __IO uint32_t AAC_CTRL_1;
        struct
        {
            __I uint32_t XAAC_BUSY: 1;
            __I uint32_t XAAC_READY: 1;
            __I uint32_t XTAL_GM_OUT: 6;
            __I uint32_t xaac_curr_state: 4;
            __IO uint32_t EN_XTAL_AAC_GM: 1;
            __IO uint32_t EN_XTAL_AAC_PKDET: 1;
            __I uint32_t XTAL_PKDET_OUT: 1;
            __IO uint32_t RESERVED807: 1;
            __IO uint32_t RESERVED806: 16;
        } BITS_334;
    } u_334;

    /* 0x0338       0x4000_0338
        0       R/W    disable_pll_pre_gating                  1'b0
        15:1    R/W    RESERVED825                             15'h0
        16      R      XTAL32K_OK                              1'h0
        17      R      OSC32K_OK                               1'h0
        22:18   R      XTAL_CTRL_DEBUG_OUT[4:0]                5'h0
        23      R      BT_READY_PLL2                           1'h0
        24      R      BT_READY_PLL1                           1'h0
        25      R      XTAL_OK                                 1'h0
        27:26   R      XTAL_CTRL_DEBUG_OUT[6:5]                3'h0
        28      R      BT_READY_PLL3                           1'h0
        31:29   R      XTAL_MODE_O                             3'h0
    */
    union
    {
        __IO uint32_t REG_0x338;
        struct
        {
            __IO uint32_t disable_pll_pre_gating: 1;
            __IO uint32_t RESERVED825: 15;
            __I uint32_t XTAL32K_OK: 1;
            __I uint32_t OSC32K_OK: 1;
            __I uint32_t XTAL_CTRL_DEBUG_OUT_4_0: 5;
            __I uint32_t BT_READY_PLL2: 1;
            __I uint32_t BT_READY_PLL1: 1;
            __I uint32_t XTAL_OK: 1;
            __I uint32_t XTAL_CTRL_DEBUG_OUT_6_5: 2;
            __I uint32_t BT_READY_PLL3: 1;
            __I uint32_t XTAL_MODE_O: 3;
        } BITS_338;
    } u_338;

    /* 0x033C       0x4000_033c
        0       R/W    resetn                                  1'b0
        1       R/W    EN_XTAL_PDCK_DIGI                       1'b0
        2       R/W    PDCK_SEARCH_MODE                        1'b0
        4:3     R/W    PDCK_WAIT_CYC[1:0]                      2'b01
        9:5     R/W    VREF_MANUAL[4:0]                        5'h1F
        14:10   R/W    VREF_INIT[4:0]                          5'h1F
        16:15   R/W    XTAL_PDCK_UNIT[1:0]                     2'b01
        21:17   R/W    XPDCK_VREF_SEL[4:0]                     5'h2
        22      R/W    PDCK_LPOW                               1'b0
        27:23   R/W    RESERVED829                             5'h0
        31:28   R      pdck_state[3:0]                         4'h0
    */
    union
    {
        __IO uint32_t XTAL_PDCK;
        struct
        {
            __IO uint32_t resetn: 1;
            __IO uint32_t EN_XTAL_PDCK_DIGI: 1;
            __IO uint32_t PDCK_SEARCH_MODE: 1;
            __IO uint32_t PDCK_WAIT_CYC_1_0: 2;
            __IO uint32_t VREF_MANUAL_4_0: 5;
            __IO uint32_t VREF_INIT_4_0: 5;
            __IO uint32_t XTAL_PDCK_UNIT_1_0: 2;
            __IO uint32_t XPDCK_VREF_SEL_4_0: 5;
            __IO uint32_t PDCK_LPOW: 1;
            __IO uint32_t RESERVED829: 5;
            __I uint32_t pdck_state_3_0: 4;
        } BITS_33C;
    } u_33C;

    /* 0x0340       0x4000_0340
        31:0    R      RESERVED840                             32'h0
    */
    union
    {
        __IO uint32_t USB_ISO_INT_CTRL;
        struct
        {
            __I uint32_t RESERVED840: 32;
        } BITS_340;
    } u_340;

    /* 0x0344       0x4000_0344
        31:0    R      RESERVED842                             32'h0
    */
    union
    {
        __IO uint32_t REG_0x344;
        struct
        {
            __I uint32_t RESERVED842: 32;
        } BITS_344;
    } u_344;

    /* 0x0348       0x4000_0348
        8:0     R      RESERVED847                             9'h0
        9       R/W    r_irrc_clk_sel                          1'b0
        10      R/W    r_irrc_clk_src_pll_sel                  1'b0
        31:11   R      RESERVED844                             21'h0
    */
    union
    {
        __IO uint32_t REG_0x348;
        struct
        {
            __I uint32_t RESERVED847: 9;
            __IO uint32_t r_irrc_clk_sel: 1;
            __IO uint32_t r_irrc_clk_src_pll_sel: 1;
            __I uint32_t RESERVED844: 21;
        } BITS_348;
    } u_348;

    __IO uint32_t RSVD_0x34c[4];

    /* 0x035C       0x4000_035c
        2:0     R/W    RESERVED863                             3'h0
        4:3     R/W    BIT_PERI_UART0_CLK_DIV                  2'h0
        6:5     R/W    BIT_PERI_UART1_CLK_DIV                  2'h0
        8:7     R/W    BIT_PERI_UART2_CLK_DIV                  2'h0
        10:9    R/W    BIT_PERI_UART3_CLK_DIV                  2'h0
        12:11   R/W    BIT_PERI_UART4_CLK_DIV                  2'h0
        14:13   R/W    BIT_PERI_UART5_CLK_DIV                  2'h0
        16:15   R/W    BIT_PERI_I2C0_CLK_DIV                   2'h0
        18:17   R/W    BIT_PERI_I2C1_CLK_DIV                   2'h0
        21:19   R/W    BIT_PERI_SPI0_CLK_DIV                   3'h0
        24:22   R/W    BIT_PERI_SPI1_CLK_DIV                   3'h0
        27:25   R/W    BIT_PERI_SPI2_CLK_DIV                   3'h0
        29:28   R/W    BIT_PERI_I2C2_CLK_DIV                   2'h0
        30      R/W    r_spi1_clk_src_pll_sel                  1'b0
        31      R/W    RESERVED849                             1'b0
    */
    union
    {
        __IO uint32_t REG_PERI_GTIMER_CLK_SRC1;
        struct
        {
            __IO uint32_t RESERVED863: 3;
            __IO uint32_t BIT_PERI_UART0_CLK_DIV: 2;
            __IO uint32_t BIT_PERI_UART1_CLK_DIV: 2;
            __IO uint32_t BIT_PERI_UART2_CLK_DIV: 2;
            __IO uint32_t BIT_PERI_UART3_CLK_DIV: 2;
            __IO uint32_t BIT_PERI_UART4_CLK_DIV: 2;
            __IO uint32_t BIT_PERI_UART5_CLK_DIV: 2;
            __IO uint32_t BIT_PERI_I2C0_CLK_DIV: 2;
            __IO uint32_t BIT_PERI_I2C1_CLK_DIV: 2;
            __IO uint32_t BIT_PERI_SPI0_CLK_DIV: 3;
            __IO uint32_t BIT_PERI_SPI1_CLK_DIV: 3;
            __IO uint32_t BIT_PERI_SPI2_CLK_DIV: 3;
            __IO uint32_t BIT_PERI_I2C2_CLK_DIV: 2;
            __IO uint32_t r_spi1_clk_src_pll_sel: 1;
            __IO uint32_t RESERVED849: 1;
        } BITS_35C;
    } u_35C;

    /* 0x0360       0x4000_0360
        7:0     R/W    RESERVED878                             8'h0
        8       R/W    BIT_TIMER_CLK_32K_EN                    1'h1
        9       R/W    RESERVED876                             1'h1
        10      R/W    RESERVED875                             1'h0
        11      R/W    RESERVED874                             1'h0
        12      R/W    RESERVED873                             1'h0
        13      R/W    RESERVED872                             1'h0
        15:14   R/W    RESERVED871                             2'h0
        18:16   R/W    RESERVED870                             3'h0
        21:19   R/W    RESERVED869                             3'h0
        24:22   R/W    RESERVED868                             3'h0
        27:25   R/W    RESERVED867                             3'h0
        30:28   R/W    RESERVED866                             3'h0
        31      R/W    RESERVED865                             1'h0
    */
    union
    {
        __IO uint32_t REG_PERI_GTIMER_CLK_SRC0;
        struct
        {
            __IO uint32_t RESERVED878: 8;
            __IO uint32_t BIT_TIMER_CLK_32K_EN: 1;
            __IO uint32_t RESERVED876: 1;
            __IO uint32_t RESERVED875: 1;
            __IO uint32_t RESERVED874: 1;
            __IO uint32_t RESERVED873: 1;
            __IO uint32_t RESERVED872: 1;
            __IO uint32_t RESERVED871: 2;
            __IO uint32_t RESERVED870: 3;
            __IO uint32_t RESERVED869: 3;
            __IO uint32_t RESERVED868: 3;
            __IO uint32_t RESERVED867: 3;
            __IO uint32_t RESERVED866: 3;
            __IO uint32_t RESERVED865: 1;
        } BITS_360;
    } u_360;

    /* 0x0364       0x4000_0364
        15:0    R      RESERVED881                             16'h0
        31:16   R      RESERVED880                             16'h0
    */
    union
    {
        __IO uint32_t REG_PERI_PWM2_DZONE_CTRL;
        struct
        {
            __I uint32_t RESERVED881: 16;
            __I uint32_t RESERVED880: 16;
        } BITS_364;
    } u_364;

    /* 0x0368       0x4000_0368
        15:0    R      RESERVED884                             16'h0
        31:16   R      RESERVED883                             16'h0
    */
    union
    {
        __IO uint32_t REG_PERI_PWM3_DZONE_CTRL;
        struct
        {
            __I uint32_t RESERVED884: 16;
            __I uint32_t RESERVED883: 16;
        } BITS_368;
    } u_368;

