wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x036C       0x4000_036c
        2:0     R/W    ETIMER0_0_CLK_DIV_SEL                   3'h0
        3       R/W    ETIMER0_0_CLK_DIV_EN                    1'h0
        6:4     R/W    ETIMER0_1_CLK_DIV_SEL                   3'h0
        7       R/W    ETIMER0_1_CLK_DIV_EN                    1'h0
        20:8    R/W    RESERVED893                             13'h0
        22:21   R/W    CAN2_LP_SCAN_DIV_SEL                    2'h0
        23      R/W    CAN2_SCAN_DIV_SEL                       1'h0
        25:24   R/W    CAN0_LP_SCAN_DIV_SEL                    2'h0
        26      R/W    CAN0_SCAN_DIV_SEL                       1'h0
        28:27   R/W    CAN1_LP_SCAN_DIV_SEL                    2'h0
        29      R/W    CAN1_SCAN_DIV_SEL                       1'h0
        31:30   R/W    RESERVED886                             2'h0
    */
    union
    {
        __IO uint32_t REG_PERI_ETIMER0_CAN_DIV;
        struct
        {
            __IO uint32_t ETIMER0_0_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER0_0_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER0_1_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER0_1_CLK_DIV_EN: 1;
            __IO uint32_t RESERVED893: 13;
            __IO uint32_t CAN2_LP_SCAN_DIV_SEL: 2;
            __IO uint32_t CAN2_SCAN_DIV_SEL: 1;
            __IO uint32_t CAN0_LP_SCAN_DIV_SEL: 2;
            __IO uint32_t CAN0_SCAN_DIV_SEL: 1;
            __IO uint32_t CAN1_LP_SCAN_DIV_SEL: 2;
            __IO uint32_t CAN1_SCAN_DIV_SEL: 1;
            __IO uint32_t RESERVED886: 2;
        } BITS_36C;
    } u_36C;

    /* 0x0370       0x4000_0370
        2:0     R/W    ETIMER1_0_CLK_DIV_SEL                   3'h0
        3       R/W    ETIMER1_0_CLK_DIV_EN                    1'h0
        6:4     R/W    ETIMER1_1_CLK_DIV_SEL                   3'h0
        7       R/W    ETIMER1_1_CLK_DIV_EN                    1'h0
        10:8    R/W    ETIMER1_2_CLK_DIV_SEL                   3'h0
        11      R/W    ETIMER1_2_CLK_DIV_EN                    1'h0
        14:12   R/W    ETIMER1_3_CLK_DIV_SEL                   3'h0
        15      R/W    ETIMER1_3_CLK_DIV_EN                    1'h0
        18:16   R/W    ETIMER1_4_CLK_DIV_SEL                   3'h0
        19      R/W    ETIMER1_4_CLK_DIV_EN                    1'h0
        22:20   R/W    ETIMER1_5_CLK_DIV_SEL                   3'h0
        23      R/W    ETIMER1_5_CLK_DIV_EN                    1'h0
        26:24   R/W    RESERVED902                             3'h0
        27      R/W    RESERVED901                             1'h0
        30:28   R/W    RESERVED900                             3'h0
        31      R/W    RESERVED899                             1'h0
    */
    union
    {
        __IO uint32_t REG_PERI_ETIMER1_DIV_G0;
        struct
        {
            __IO uint32_t ETIMER1_0_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_0_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_1_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_1_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_2_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_2_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_3_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_3_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_4_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_4_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_5_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_5_CLK_DIV_EN: 1;
            __IO uint32_t RESERVED902: 3;
            __IO uint32_t RESERVED901: 1;
            __IO uint32_t RESERVED900: 3;
            __IO uint32_t RESERVED899: 1;
        } BITS_370;
    } u_370;

    /* 0x0374       0x4000_0374
        2:0     R/W    ETIMER1_6_CLK_DIV_SEL                   3'h0
        3       R/W    ETIMER1_6_CLK_DIV_EN                    1'h0
        4       R/W    ETIMER1_6_CLK_SEL0                      1'h0
        5       R/W    ETIMER1_6_CLK_SEL1                      1'h0
        6       R/W    ETIMER1_6_PLL_CLK_SEL                   1'h0
        9:7     R/W    ETIMER1_6_PWM_CLK_DIV_SEL               3'h0
        10      R/W    ETIMER1_6_PWM_CLK_DIV_EN                1'h0
        11      R/W    ETIMER1_6_PWM_CLK_EN                    1'h0
        12      R/W    ETIMER1_6_PWM_CLK_SEL                   1'h0
        15:13   R/W    RESERVED926                             3'h0
        18:16   R/W    ETIMER1_7_CLK_DIV_SEL                   3'h0
        19      R/W    ETIMER1_7_CLK_DIV_EN                    1'h0
        20      R/W    ETIMER1_7_CLK_SEL0                      1'h0
        21      R/W    ETIMER1_7_CLK_SEL1                      1'h0
        22      R/W    ETIMER1_7_PLL_CLK_SEL                   1'h0
        25:23   R/W    ETIMER1_7_PWM_CLK_DIV_SEL               3'h0
        26      R/W    ETIMER1_7_PWM_CLK_DIV_EN                1'h0
        27      R/W    ETIMER1_7_PWM_CLK_EN                    1'h0
        28      R/W    ETIMER1_7_PWM_CLK_SEL                   1'h0
        31:29   R/W    RESERVED916                             3'h0
    */
    union
    {
        __IO uint32_t REG_PERI_ETIMER1_G1_DIV;
        struct
        {
            __IO uint32_t ETIMER1_6_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_6_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_6_CLK_SEL0: 1;
            __IO uint32_t ETIMER1_6_CLK_SEL1: 1;
            __IO uint32_t ETIMER1_6_PLL_CLK_SEL: 1;
            __IO uint32_t ETIMER1_6_PWM_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_6_PWM_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_6_PWM_CLK_EN: 1;
            __IO uint32_t ETIMER1_6_PWM_CLK_SEL: 1;
            __IO uint32_t RESERVED926: 3;
            __IO uint32_t ETIMER1_7_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_7_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_7_CLK_SEL0: 1;
            __IO uint32_t ETIMER1_7_CLK_SEL1: 1;
            __IO uint32_t ETIMER1_7_PLL_CLK_SEL: 1;
            __IO uint32_t ETIMER1_7_PWM_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_7_PWM_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_7_PWM_CLK_EN: 1;
            __IO uint32_t ETIMER1_7_PWM_CLK_SEL: 1;
            __IO uint32_t RESERVED916: 3;
        } BITS_374;
    } u_374;

    /* 0x0378       0x4000_0378
        2:0     R/W    ETIMER1_8_CLK_DIV_SEL                   3'h0
        3       R/W    ETIMER1_8_CLK_DIV_EN                    1'h0
        4       R/W    ETIMER1_8_CLK_SEL0                      1'h0
        5       R/W    ETIMER1_8_CLK_SEL1                      1'h0
        6       R/W    ETIMER1_8_PLL_CLK_SEL                   1'h0
        9:7     R/W    ETIMER1_8_PWM_CLK_DIV_SEL               3'h0
        10      R/W    ETIMER1_8_PWM_CLK_DIV_EN                1'h0
        11      R/W    ETIMER1_8_PWM_CLK_EN                    1'h0
        12      R/W    ETIMER1_8_PWM_CLK_SEL                   1'h0
        15:13   R/W    RESERVED947                             3'h0
        18:16   R/W    ETIMER1_9_CLK_DIV_SEL                   3'h0
        19      R/W    ETIMER1_9_CLK_DIV_EN                    1'h0
        22:20   R/W    ETIMER1_9_PWM_CLK_DIV_SEL               3'h0
        23      R/W    ETIMER1_9_PWM_CLK_DIV_EN                1'h0
        24      R/W    ETIMER1_9_PWM_CLK_EN                    1'h0
        25      R/W    ETIMER1_9_PWM_CLK_SEL                   1'h0
        28:26   R/W    ETIMER1_9_DEB_CLK_DIV_SEL               3'h0
        29      R/W    ETIMER1_9_DEB_CLK_DIV_EN                1'h0
        30      R/W    ETIMER1_9_DEB_CLK_CLK_EN                1'h0
        31      R/W    RESERVED937                             1'h0
    */
    union
    {
        __IO uint32_t REG_PERI_ETIMER1_G2_DIV;
        struct
        {
            __IO uint32_t ETIMER1_8_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_8_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_8_CLK_SEL0: 1;
            __IO uint32_t ETIMER1_8_CLK_SEL1: 1;
            __IO uint32_t ETIMER1_8_PLL_CLK_SEL: 1;
            __IO uint32_t ETIMER1_8_PWM_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_8_PWM_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_8_PWM_CLK_EN: 1;
            __IO uint32_t ETIMER1_8_PWM_CLK_SEL: 1;
            __IO uint32_t RESERVED947: 3;
            __IO uint32_t ETIMER1_9_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_9_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_9_PWM_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_9_PWM_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_9_PWM_CLK_EN: 1;
            __IO uint32_t ETIMER1_9_PWM_CLK_SEL: 1;
            __IO uint32_t ETIMER1_9_DEB_CLK_DIV_SEL: 3;
            __IO uint32_t ETIMER1_9_DEB_CLK_DIV_EN: 1;
            __IO uint32_t ETIMER1_9_DEB_CLK_CLK_EN: 1;
            __IO uint32_t RESERVED937: 1;
        } BITS_378;
    } u_378;

