wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    __IO uint32_t RSVD_0x37c[4];

    /* 0x038C       0x4000_038c
        31:0    R/W    SWR_SS_LUT_2                            32'h0
    */
    union
    {
        __IO uint32_t REG_0x38C;
        struct
        {
            __IO uint32_t SWR_SS_LUT_2: 32;
        } BITS_38C;
    } u_38C;

    /* 0x0390       0x4000_0390
        31:0    R/W    SWR_SS_LUT_3                            32'h0
    */
    union
    {
        __IO uint32_t REG_0x390;
        struct
        {
            __IO uint32_t SWR_SS_LUT_3: 32;
        } BITS_390;
    } u_390;

    /* 0x0394       0x4000_0394
        31:0    R/W    SWR_SS_LUT_4                            32'h0
    */
    union
    {
        __IO uint32_t REG_0x394;
        struct
        {
            __IO uint32_t SWR_SS_LUT_4: 32;
        } BITS_394;
    } u_394;

    /* 0x0398       0x4000_0398
        31:0    R/W    SWR_SS_LUT_5                            32'h0
    */
    union
    {
        __IO uint32_t REG_0x398;
        struct
        {
            __IO uint32_t SWR_SS_LUT_5: 32;
        } BITS_398;
    } u_398;

    /* 0x039C       0x4000_039c
        15:0    R/W    SWR_SS_CONFIG                           16'h0
        31:16   R/W    RESERVED966                             16'h0
    */
    union
    {
        __IO uint32_t REG_0x39C;
        struct
        {
            __IO uint32_t SWR_SS_CONFIG: 16;
            __IO uint32_t RESERVED966: 16;
        } BITS_39C;
    } u_39C;

    /* 0x03A0       0x4000_03a0
        31:0    R/W    SWR_SS_LUT_0                            32'h0
    */
    union
    {
        __IO uint32_t REG_0x3A0;
        struct
        {
            __IO uint32_t SWR_SS_LUT_0: 32;
        } BITS_3A0;
    } u_3A0;

    /* 0x03A4       0x4000_03a4
        31:0    R/W    SWR_SS_LUT_1                            32'h0
    */
    union
    {
        __IO uint32_t REG_0x3A4;
        struct
        {
            __IO uint32_t SWR_SS_LUT_1: 32;
        } BITS_3A4;
    } u_3A4;

    __IO uint32_t RSVD_0x3a8[18];

    /* 0x03F0       0x4000_03f0
        1:0     R/W    R_OCC0_DBG_EN                           2'h0
        3:2     R/W    R_OCC1_DBG_EN                           2'h0
        5:4     R/W    R_OCC2_DBG_EN                           2'h0
        7:6     R/W    R_OCC3_DBG_EN                           2'h0
        9:8     R/W    R_OCC4_DBG_EN                           2'h0
        14:10   R/W    R_OCC_DBG_SEL                           5'h0
        31:15   R/W    RESERVED973                             17'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR7_79_64;
        struct
        {
            __IO uint32_t R_OCC0_DBG_EN: 2;
            __IO uint32_t R_OCC1_DBG_EN: 2;
            __IO uint32_t R_OCC2_DBG_EN: 2;
            __IO uint32_t R_OCC3_DBG_EN: 2;
            __IO uint32_t R_OCC4_DBG_EN: 2;
            __IO uint32_t R_OCC_DBG_SEL: 5;
            __IO uint32_t RESERVED973: 17;
        } BITS_3F0;
    } u_3F0;

    __IO uint32_t RSVD_0x3f4[1];

    /* 0x03F8       0x4000_03f8
        0       R/W    CORE7_EN_HVD17_LOWIQ                    1'h0
        4:1     R/W    CORE7_TUNE_HVD17_IB                     4'h0
        5       R/W    CORE7_X4_PFM_COMP_IB                    1'h0
        8:6     R/W    CORE7_TUNE_PFM_VREFOCPPFM               3'h0
        14:9    R/W    CORE7_TUNE_SAW_ICLK                     6'h0
        31:15   R/W    RESERVED981                             17'h0
    */
    union
    {
        __IO uint32_t AUTO_SW_PAR7_79_64;
        struct
        {
            __IO uint32_t CORE7_EN_HVD17_LOWIQ: 1;
            __IO uint32_t CORE7_TUNE_HVD17_IB: 4;
            __IO uint32_t CORE7_X4_PFM_COMP_IB: 1;
            __IO uint32_t CORE7_TUNE_PFM_VREFOCPPFM: 3;
            __IO uint32_t CORE7_TUNE_SAW_ICLK: 6;
            __IO uint32_t RESERVED981: 17;
        } BITS_3F8;
    } u_3F8;

    __IO uint32_t RSVD_0x3fc[65];

    /* 0x0500       0x4000_0500
        7:0     R/W    PMUX_GPIO_ADC_0                         8'h0
        15:8    R/W    PMUX_GPIO_ADC_1                         8'h0
        23:16   R/W    PMUX_GPIO_ADC_2                         8'h0
        31:24   R/W    PMUX_GPIO_ADC_3                         8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO_ADC_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_ADC_0: 8;
            __IO uint32_t PMUX_GPIO_ADC_1: 8;
            __IO uint32_t PMUX_GPIO_ADC_2: 8;
            __IO uint32_t PMUX_GPIO_ADC_3: 8;
        } BITS_500;
    } u_500;

    /* 0x0504       0x4000_0504
        7:0     R/W    PMUX_GPIO_ADC_4                         8'h0
        15:8    R/W    PMUX_GPIO_ADC_5                         8'h0
        23:16   R/W    PMUX_GPIO_ADC_6                         8'h0
        31:24   R/W    PMUX_GPIO_ADC_7                         8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO_ADC_4_7;
        struct
        {
            __IO uint32_t PMUX_GPIO_ADC_4: 8;
            __IO uint32_t PMUX_GPIO_ADC_5: 8;
            __IO uint32_t PMUX_GPIO_ADC_6: 8;
            __IO uint32_t PMUX_GPIO_ADC_7: 8;
        } BITS_504;
    } u_504;

    /* 0x0508       0x4000_0508
        7:0     R/W    PMUX_GPIO_P1_0                          8'h38
        15:8    R/W    PMUX_GPIO_P1_1                          8'h39
        23:16   R/W    PMUX_GPIO_P1_2                          8'h0
        31:24   R/W    PMUX_GPIO_P1_3                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO1_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P1_0: 8;
            __IO uint32_t PMUX_GPIO_P1_1: 8;
            __IO uint32_t PMUX_GPIO_P1_2: 8;
            __IO uint32_t PMUX_GPIO_P1_3: 8;
        } BITS_508;
    } u_508;

    /* 0x050C       0x4000_050c
        7:0     R/W    PMUX_GPIO_P1_4                          8'h0
        15:8    R/W    PMUX_GPIO_P1_5                          8'h0
        31:16   R/W    RESERVED1003                            16'h0
    */
    union
    {
        __IO uint32_t REG_GPIO1_4_5;
        struct
        {
            __IO uint32_t PMUX_GPIO_P1_4: 8;
            __IO uint32_t PMUX_GPIO_P1_5: 8;
            __IO uint32_t RESERVED1003: 16;
        } BITS_50C;
    } u_50C;

    /* 0x0510       0x4000_0510
        7:0     R/W    PMUX_GPIO_P2_0                          8'h1b
        15:8    R/W    PMUX_GPIO_P2_1                          8'h0
        23:16   R/W    PMUX_GPIO_P2_2                          8'h0
        31:24   R/W    PMUX_GPIO_P2_3                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO2_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P2_0: 8;
            __IO uint32_t PMUX_GPIO_P2_1: 8;
            __IO uint32_t PMUX_GPIO_P2_2: 8;
            __IO uint32_t PMUX_GPIO_P2_3: 8;
        } BITS_510;
    } u_510;

    /* 0x0514       0x4000_0514
        7:0     R/W    PMUX_GPIO_P2_4                          8'h0
        15:8    R/W    PMUX_GPIO_P2_5                          8'h0
        23:16   R/W    PMUX_GPIO_P2_6                          8'h0
        31:24   R/W    PMUX_GPIO_P2_7                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO2_4_7;
        struct
        {
            __IO uint32_t PMUX_GPIO_P2_4: 8;
            __IO uint32_t PMUX_GPIO_P2_5: 8;
            __IO uint32_t PMUX_GPIO_P2_6: 8;
            __IO uint32_t PMUX_GPIO_P2_7: 8;
        } BITS_514;
    } u_514;

    /* 0x0518       0x4000_0518
        7:0     R/W    PMUX_GPIO_P3_0                          8'h24
        15:8    R/W    PMUX_GPIO_P3_1                          8'h23
        23:16   R/W    PMUX_GPIO_P3_2                          8'h0
        31:24   R/W    PMUX_GPIO_P3_3                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO3_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P3_0: 8;
            __IO uint32_t PMUX_GPIO_P3_1: 8;
            __IO uint32_t PMUX_GPIO_P3_2: 8;
            __IO uint32_t PMUX_GPIO_P3_3: 8;
        } BITS_518;
    } u_518;

