wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x051C       0x4000_051c
        7:0     R/W    PMUX_GPIO_P3_4                          8'h0
        15:8    R/W    PMUX_GPIO_P3_5                          8'h0
        31:16   R/W    RESERVED1022                            16'h0
    */
    union
    {
        __IO uint32_t REG_GPIO3_4_5;
        struct
        {
            __IO uint32_t PMUX_GPIO_P3_4: 8;
            __IO uint32_t PMUX_GPIO_P3_5: 8;
            __IO uint32_t RESERVED1022: 16;
        } BITS_51C;
    } u_51C;

    /* 0x0520       0x4000_0520
        7:0     R/W    PMUX_GPIO_P4_0                          8'h0
        15:8    R/W    PMUX_GPIO_P4_1                          8'h0
        23:16   R/W    PMUX_GPIO_P4_2                          8'h0
        31:24   R/W    PMUX_GPIO_P4_3                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO4_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P4_0: 8;
            __IO uint32_t PMUX_GPIO_P4_1: 8;
            __IO uint32_t PMUX_GPIO_P4_2: 8;
            __IO uint32_t PMUX_GPIO_P4_3: 8;
        } BITS_520;
    } u_520;

    /* 0x0524       0x4000_0524
        7:0     R/W    PMUX_GPIO_P4_4                          8'h0
        15:8    R/W    PMUX_GPIO_P4_5                          8'h0
        23:16   R/W    PMUX_GPIO_P4_6                          8'h0
        31:24   R/W    PMUX_GPIO_P4_7                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO4_4_7;
        struct
        {
            __IO uint32_t PMUX_GPIO_P4_4: 8;
            __IO uint32_t PMUX_GPIO_P4_5: 8;
            __IO uint32_t PMUX_GPIO_P4_6: 8;
            __IO uint32_t PMUX_GPIO_P4_7: 8;
        } BITS_524;
    } u_524;

    /* 0x0528       0x4000_0528
        7:0     R/W    PMUX_GPIO_P5_0                          8'h0
        15:8    R/W    PMUX_GPIO_P5_1                          8'h0
        23:16   R/W    PMUX_GPIO_P5_2                          8'h0
        31:24   R/W    PMUX_GPIO_P5_3                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO5_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P5_0: 8;
            __IO uint32_t PMUX_GPIO_P5_1: 8;
            __IO uint32_t PMUX_GPIO_P5_2: 8;
            __IO uint32_t PMUX_GPIO_P5_3: 8;
        } BITS_528;
    } u_528;

    /* 0x052C       0x4000_052c
        7:0     R/W    PMUX_GPIO_P5_4                          8'h0
        15:8    R/W    PMUX_GPIO_P5_5                          8'h0
        23:16   R/W    PMUX_GPIO_P5_6                          8'h0
        31:24   R/W    RESERVED1041                            8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO5_4_6;
        struct
        {
            __IO uint32_t PMUX_GPIO_P5_4: 8;
            __IO uint32_t PMUX_GPIO_P5_5: 8;
            __IO uint32_t PMUX_GPIO_P5_6: 8;
            __IO uint32_t RESERVED1041: 8;
        } BITS_52C;
    } u_52C;

    /* 0x0530       0x4000_0530
        7:0     R/W    PMUX_GPIO_P6_0                          8'h0
        15:8    R/W    PMUX_GPIO_P6_1                          8'h0
        23:16   R/W    PMUX_GPIO_P6_2                          8'h0
        31:24   R/W    PMUX_GPIO_P6_3                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO6_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P6_0: 8;
            __IO uint32_t PMUX_GPIO_P6_1: 8;
            __IO uint32_t PMUX_GPIO_P6_2: 8;
            __IO uint32_t PMUX_GPIO_P6_3: 8;
        } BITS_530;
    } u_530;

    /* 0x0534       0x4000_0534
        7:0     R/W    PMUX_GPIO_P6_4                          8'h0
        31:8    R/W    RESERVED1051                            24'h0
    */
    union
    {
        __IO uint32_t REG_GPIO6_4;
        struct
        {
            __IO uint32_t PMUX_GPIO_P6_4: 8;
            __IO uint32_t RESERVED1051: 24;
        } BITS_534;
    } u_534;

    /* 0x0538       0x4000_0538
        7:0     R/W    PMUX_GPIO_P7_0                          8'h0
        15:8    R/W    PMUX_GPIO_P7_1                          8'h0
        23:16   R/W    PMUX_GPIO_P7_2                          8'h0
        31:24   R/W    PMUX_GPIO_P7_3                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO7_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P7_0: 8;
            __IO uint32_t PMUX_GPIO_P7_1: 8;
            __IO uint32_t PMUX_GPIO_P7_2: 8;
            __IO uint32_t PMUX_GPIO_P7_3: 8;
        } BITS_538;
    } u_538;

    /* 0x053C       0x4000_053c
        7:0     R/W    PMUX_GPIO_P7_4                          8'h0
        15:8    R/W    PMUX_GPIO_P7_5                          8'h0
        23:16   R/W    PMUX_GPIO_P7_6                          8'h0
        31:24   R/W    RESERVED1059                            8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO7_4_6;
        struct
        {
            __IO uint32_t PMUX_GPIO_P7_4: 8;
            __IO uint32_t PMUX_GPIO_P7_5: 8;
            __IO uint32_t PMUX_GPIO_P7_6: 8;
            __IO uint32_t RESERVED1059: 8;
        } BITS_53C;
    } u_53C;

    /* 0x0540       0x4000_0540
        7:0     R/W    PMUX_GPIO_P8_0                          8'h0
        15:8    R/W    PMUX_GPIO_P8_1                          8'h0
        23:16   R/W    PMUX_GPIO_P8_2                          8'h0
        31:24   R/W    PMUX_GPIO_P8_3                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO8_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P8_0: 8;
            __IO uint32_t PMUX_GPIO_P8_1: 8;
            __IO uint32_t PMUX_GPIO_P8_2: 8;
            __IO uint32_t PMUX_GPIO_P8_3: 8;
        } BITS_540;
    } u_540;

    /* 0x0544       0x4000_0544
        7:0     R/W    PMUX_GPIO_P8_4                          8'h0
        15:8    R/W    PMUX_GPIO_P8_5                          8'h0
        23:16   R/W    PMUX_GPIO_P8_6                          8'h0
        31:24   R/W    PMUX_GPIO_P8_7                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO8_4_7;
        struct
        {
            __IO uint32_t PMUX_GPIO_P8_4: 8;
            __IO uint32_t PMUX_GPIO_P8_5: 8;
            __IO uint32_t PMUX_GPIO_P8_6: 8;
            __IO uint32_t PMUX_GPIO_P8_7: 8;
        } BITS_544;
    } u_544;

