wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x0548       0x4000_0548
        7:0     R/W    PMUX_GPIO_P9_0                          8'h0
        15:8    R/W    PMUX_GPIO_P9_1                          8'h0
        23:16   R/W    PMUX_GPIO_P9_2                          8'h0
        31:24   R/W    PMUX_GPIO_P9_3                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO9_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P9_0: 8;
            __IO uint32_t PMUX_GPIO_P9_1: 8;
            __IO uint32_t PMUX_GPIO_P9_2: 8;
            __IO uint32_t PMUX_GPIO_P9_3: 8;
        } BITS_548;
    } u_548;

    /* 0x054C       0x4000_054c
        7:0     R/W    PMUX_GPIO_P9_4                          8'h0
        15:8    R/W    PMUX_GPIO_P9_5                          8'h0
        23:16   R/W    PMUX_GPIO_P9_6                          8'h0
        31:24   R/W    RESERVED1079                            8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO9_4_6;
        struct
        {
            __IO uint32_t PMUX_GPIO_P9_4: 8;
            __IO uint32_t PMUX_GPIO_P9_5: 8;
            __IO uint32_t PMUX_GPIO_P9_6: 8;
            __IO uint32_t RESERVED1079: 8;
        } BITS_54C;
    } u_54C;

    /* 0x0550       0x4000_0550
        7:0     R/W    PMUX_GPIO_P10_0                         8'h0
        15:8    R/W    PMUX_GPIO_P10_1                         8'h0
        23:16   R/W    PMUX_GPIO_P10_2                         8'h0
        31:24   R/W    PMUX_GPIO_P10_3                         8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO10_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_P10_0: 8;
            __IO uint32_t PMUX_GPIO_P10_1: 8;
            __IO uint32_t PMUX_GPIO_P10_2: 8;
            __IO uint32_t PMUX_GPIO_P10_3: 8;
        } BITS_550;
    } u_550;

    /* 0x0554       0x4000_0554
        7:0     R/W    PMUX_GPIO_P10_4                         8'h0
        15:8    R/W    PMUX_GPIO_P10_5                         8'h0
        23:16   R/W    PMUX_GPIO_P10_6                         8'h0
        31:24   R/W    RESERVED1089                            8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO10_4_6;
        struct
        {
            __IO uint32_t PMUX_GPIO_P10_4: 8;
            __IO uint32_t PMUX_GPIO_P10_5: 8;
            __IO uint32_t PMUX_GPIO_P10_6: 8;
            __IO uint32_t RESERVED1089: 8;
        } BITS_554;
    } u_554;

    /* 0x0558       0x4000_0558
        7:0     R/W    PMUX_GPIO_H_0                           8'h0
        15:8    R/W    PMUX_GPIO_H_1                           8'h0
        23:16   R/W    PMUX_GPIO_H_2                           8'h0
        31:24   R/W    PMUX_GPIO_H_3                           8'h0
    */
    union
    {
        __IO uint32_t REG_GPIOH_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_H_0: 8;
            __IO uint32_t PMUX_GPIO_H_1: 8;
            __IO uint32_t PMUX_GPIO_H_2: 8;
            __IO uint32_t PMUX_GPIO_H_3: 8;
        } BITS_558;
    } u_558;

    /* 0x055C       0x4000_055c
        7:0     R/W    PMUX_GPIO_H_4                           8'h0
        15:8    R/W    PMUX_GPIO_H_5                           8'h0
        23:16   R/W    PMUX_GPIO_H_6                           8'h0
        31:24   R/W    PMUX_GPIO_H_7                           8'h0
    */
    union
    {
        __IO uint32_t REG_GPIOH_4_6;
        struct
        {
            __IO uint32_t PMUX_GPIO_H_4: 8;
            __IO uint32_t PMUX_GPIO_H_5: 8;
            __IO uint32_t PMUX_GPIO_H_6: 8;
            __IO uint32_t PMUX_GPIO_H_7: 8;
        } BITS_55C;
    } u_55C;

    /* 0x0560       0x4000_0560
        7:0     R/W    PMUX_GPIO_H_8                           8'h0
        15:8    R/W    PMUX_GPIO_H_9                           8'h0
        31:16   R/W    RESERVED1104                            16'h0
    */
    union
    {
        __IO uint32_t REG_GPIOH_8_9;
        struct
        {
            __IO uint32_t PMUX_GPIO_H_8: 8;
            __IO uint32_t PMUX_GPIO_H_9: 8;
            __IO uint32_t RESERVED1104: 16;
        } BITS_560;
    } u_560;

    /* 0x0564       0x4000_0564
        7:0     R/W    PMUX_GPIO_USB_0                         8'h0
        15:8    R/W    PMUX_GPIO_USB_1                         8'h0
        31:16   R/W    RESERVED1108                            16'h0
    */
    union
    {
        __IO uint32_t REG_GPIO_USB_0_1;
        struct
        {
            __IO uint32_t PMUX_GPIO_USB_0: 8;
            __IO uint32_t PMUX_GPIO_USB_1: 8;
            __IO uint32_t RESERVED1108: 16;
        } BITS_564;
    } u_564;

    /* 0x0568       0x4000_0568
        7:0     R/W    PMUX_GPIO_SPIC1_0                       8'h0
        15:8    R/W    PMUX_GPIO_SPIC1_1                       8'h0
        23:16   R/W    PMUX_GPIO_SPIC1_2                       8'h0
        31:24   R/W    PMUX_GPIO_SPIC1_3                       8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO_SPIC1_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_SPIC1_0: 8;
            __IO uint32_t PMUX_GPIO_SPIC1_1: 8;
            __IO uint32_t PMUX_GPIO_SPIC1_2: 8;
            __IO uint32_t PMUX_GPIO_SPIC1_3: 8;
        } BITS_568;
    } u_568;

    /* 0x056C       0x4000_056c
        7:0     R/W    PMUX_GPIO_SPIC1_4                       8'h0
        15:8    R/W    PMUX_GPIO_SPIC1_5                       8'h0
        31:16   R/W    RESERVED1117                            16'h0
    */
    union
    {
        __IO uint32_t REG_GPIO_SPIC1_4_5;
        struct
        {
            __IO uint32_t PMUX_GPIO_SPIC1_4: 8;
            __IO uint32_t PMUX_GPIO_SPIC1_5: 8;
            __IO uint32_t RESERVED1117: 16;
        } BITS_56C;
    } u_56C;

    /* 0x0570       0x4000_0570
        7:0     R/W    PMUX_GPIO_SPIC3_0                       8'h0
        15:8    R/W    PMUX_GPIO_SPIC3_1                       8'h0
        23:16   R/W    PMUX_GPIO_SPIC3_2                       8'h0
        31:24   R/W    PMUX_GPIO_SPIC3_3                       8'h0
    */
    union
    {
        __IO uint32_t REG_GPIO_SPIC3_0_3;
        struct
        {
            __IO uint32_t PMUX_GPIO_SPIC3_0: 8;
            __IO uint32_t PMUX_GPIO_SPIC3_1: 8;
            __IO uint32_t PMUX_GPIO_SPIC3_2: 8;
            __IO uint32_t PMUX_GPIO_SPIC3_3: 8;
        } BITS_570;
    } u_570;

    /* 0x0574       0x4000_0574
        7:0     R/W    PMUX_GPIO_SPIC3_4                       8'h0
        15:8    R/W    PMUX_GPIO_SPIC3_5                       8'h0
        31:16   R/W    RESERVED1126                            16'h0
    */
    union
    {
        __IO uint32_t REG_GPIO_SPIC1_4_5;
        struct
        {
            __IO uint32_t PMUX_GPIO_SPIC3_4: 8;
            __IO uint32_t PMUX_GPIO_SPIC3_5: 8;
            __IO uint32_t RESERVED1126: 16;
        } BITS_574;
    } u_574;

    __IO uint32_t RSVD_0x578[2];

