wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/pcc_reg.h
    /* 0x0580       0x4000_0580
        2:0     R      RESERVED1131                            3'h0
        31:3    R      RESERVED1130                            29'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_GROUP_CONFIG;
        struct
        {
            __I uint32_t RESERVED1131: 3;
            __I uint32_t RESERVED1130: 29;
        } BITS_580;
    } u_580;

    /* 0x0584       0x4000_0584
        1:0     R/W    GMAC_LX_BUS_TIMEOUT_THRESHOLD           2'h0
        2       R/W    GMAC_LX_BUS_TIMEOUT_EN                  1'h0
        3       R/W    GMAC_LX_BUS_DMAC_LOCK_IN                1'h0
        5:4     R/W    GMAC_MII_BUS_TIMEOUT_THRESHOLD          2'h0
        6       R/W    GMAC_MII_BUS_TIMEOUT_EN                 1'h0
        7       R/W    REG_GMAC_RX_SP_SEL                      1'h0
        8       R/W    REG_GMAC_TX_SP_SEL                      1'h0
        31:9    R/W    RESERVED1006                            23'h0
    */
    union
    {
        __IO uint32_t REG_GMAC_TIMEOUT_THRESHOLD;
        struct
        {
            __IO uint32_t GMAC_LX_BUS_TIMEOUT_THRESHOLD: 2;
            __IO uint32_t GMAC_LX_BUS_TIMEOUT_EN: 1;
            __IO uint32_t GMAC_LX_BUS_DMAC_LOCK_IN: 1;
            __IO uint32_t GMAC_MII_BUS_TIMEOUT_THRESHOLD: 2;
            __IO uint32_t GMAC_MII_BUS_TIMEOUT_EN: 1;
            __IO uint32_t REG_GMAC_RX_SP_SEL: 1;
            __IO uint32_t REG_GMAC_TX_SP_SEL: 1;
            __IO uint32_t RESERVED1006: 23;
        } BITS_584;
    } u_584;

    /* 0x0588       0x4000_0588
        18:0    R/W    GMACBASEADDR                            19'h20050
        31:19   R/W    RESERVED1015                            13'h0
    */
    union
    {
        __IO uint32_t REG_GMAC_BASE_ADDR;
        struct
        {
            __IO uint32_t GMACBASEADDR: 19;
            __IO uint32_t RESERVED1015: 13;
        } BITS_588;
    } u_588;

    /* 0x058c       0x4000_058c
        18:0    R/W    GMACBASEADDR_1                          19'h28050
        31:19   R/W    RESERVED1018                            13'h0
    */
    union
    {
        __IO uint32_t REG_GMAC_BASE_ADDR_1;
        struct
        {
            __IO uint32_t GMACBASEADDR_1: 19;
            __IO uint32_t RESERVED1018: 13;
        } BITS_58c;
    } u_58c;

    /* 0x0590       0x4000_0590
        0       R/W    REG_NEG_WL_ACT                          1'h0
        1       R/W    REG_BT_ANT_CTRL                         1'h0
        2       R/W    REG_BT_ANT_CTRL_OD                      1'h0
        31:3    R/W    RESERVED1148                            29'h0
    */
    union
    {
        __IO uint32_t REG_GMAC_BASE_ADDR_1;
        struct
        {
            __IO uint32_t REG_NEG_WL_ACT: 1;
            __IO uint32_t REG_BT_ANT_CTRL: 1;
            __IO uint32_t REG_BT_ANT_CTRL_OD: 1;
            __IO uint32_t RESERVED1148: 29;
        } BITS_590;
    } u_590;

    /* 0x0594       0x4000_0594
        31:0    R/W    REG_DSP_ALTRESETVECTOR                  32'h0
    */
    union
    {
        __IO uint32_t REG_0x254;
        struct
        {
            __IO uint32_t REG_DSP_ALTRESETVECTOR: 32;
        } BITS_594;
    } u_594;

    /* 0x0598       0x4000_0598
        7:0     R/W    PMUX_GPIO_H_10                          8'h0
        15:8    R/W    PMUX_GPIO_H_11                          8'h0
        23:16   R/W    PMUX_GPIO_H_12                          8'h0
        31:24   R/W    PMUX_GPIO_H_13                          8'h0
    */
    union
    {
        __IO uint32_t REG_GPIOH_10_13;
        struct
        {
            __IO uint32_t PMUX_GPIO_H_10: 8;
            __IO uint32_t PMUX_GPIO_H_11: 8;
            __IO uint32_t PMUX_GPIO_H_12: 8;
            __IO uint32_t PMUX_GPIO_H_13: 8;
        } BITS_598;
    } u_598;

} SYS_BLKCTRL_TypeDef;

#define SYSBLKCTRL_REG_BASE             0x40000200UL
#define SYSBLKCTRL                      ((SYS_BLKCTRL_TypeDef      *) SYSBLKCTRL_REG_BASE)

#endif //#define PCC_REG_H